{
    "poster": "Yoshi",
    "date": "2024-10-10",
    "time": "1:24 PM",
    "content": "[ Ranked Mode ]\n- Added Ranked mode\nWe are experimenting with a different approach to Ranked during early development, we expect to iterate on it in the future. The focus of this mode will be on concentrating players into specific time windows where they can opt into games where the primary focus is on game quality.\nYou must have 50 games played in order to enter this mode. If you have any behavior related restrictions (voice/text bans, report misuse, etc), you will be unable to queue into this mode.\nThe queue will be solo only at the moment and will be open from 1pm-4pm and 7pm-10pm in the respective time zones every day. Each region will have multiple time zones you can select from to find what best fits your schedule (you can only change your selection once per week). Players will be automatically assigned the server in that region that provides the best ping for the players in the match.\nWhen in this mode, you will only be matched with players that have the same medal as you. There are 11 medals in total with 6 levels in each. Everyone's medal and levels will be displayed in these ranked games.\nEvery Tuesday at 8PM GMT we will run an algorithm that calculates everyone's performance together at the same time based on the games you've played, how the opponents you played against ended up faring in subsequent games, etc. As such, medals will only be updated once per week, to allow for analysis of a wide set of match data together at once for a more accurate review of your skill (rather than a fixed numerical addition/subtraction on a per game basis).\nIn order to make sure there are enough data to cross reference with other players, you must play at least 7 games in order to be eligible to receive a rank for that week. If at any time you didn't have 7 games played in the previous week, your medal will be marked as undefined until you play enough and earn a new medal the following Tuesday.\nThe ranked queue will first open next Tuesday, October 15th at 8PM GMT. The first medals will be granted globally the following Tuesday, October 22nd 8PM GMT. You'll have a panel that shows you the history of your previous medals.\n[ General Changes ]\n- Added a 3rd casting mode, Quick Cast (shows range/radius/etc on key down, then on key up acts like Instant Cast). The three casting modes are now Instant Cast, Quick Cast, and Confirm Cast.\nView attachment quick_cast_modes.mp4\n- Added input buffering for ability usage (so if you cast an ability and then quickly cast another ability during its cast time, the next one will fire instead of the input being dropped)\nView attachment input_buffering.mp4\n- Now displaying a unique ID for builds in the description section of the build browser.  You can click on it to copy the Build ID to the clipboard to share specific builds with friends.\n- If you enter a Build ID in the search box of the build browser, it will show all of the builds for the current hero by the author of that build.\n- For private lobbies, added the ability to swap players on both teams with a button press. In addition players can be randomly shuffled across the two teams, and if lanes are being assigned, can be shuffled within the teams.\n- Added \"Allow Duplicate Heroes\" setting in Private Lobbies\n- Certain heroes now have a higher priority at being in dual lanes (Ivy and Dynamo atm)\n- Added per-player voice volume slider (accessible by clicking on a player via the ESC menu)\n- Pausing is no longer allowed in the first three minutes of the game\n- Added Thai and Indonesian localization\n- Replaced the temp Yamato VO with a new translation spoken by a native actress\n- Added Stomp AoE range indication as the Walker is about to use the ability\n- Updated the way status effects are shown above the healthbar\n- Fixed troopers being unreliable to shoot while on the zipline\n- Fixed an Unsecured Souls bug where it gave extra bounty directly to the dying hero carrying unsecured souls\n- Fixed AFK kick detection not working properly\n- Added Crit Bonus Scale tooltip to the Weapon stats in the shop\n- Fixed ESC key not working on the private lobbies page\n- Fixed respawn music not playing while spectating another player\n- Fixed a bug where the bot that would pick up the Urn was not the closest one, just the one that was in the highest player slot\n- Fixed Streamer mode not persisting between game relaunches\n- Keybinds in settings now selects the hero you're playing when you navigate to the Keybinds tab\n- Rescue beam now shows heal indicator if you heal someone with it\n- Fixed Debuff Reducer causing Teleporters to be faster\n- Steam notifications moved to the top-left from the bottom-right, to avoid minimap overlap\n- Continue to have mouse look enabled while M3 is pressed but before the ping wheel shows up\n- Enabled Middle Mouse for \"pinging\" minimap\n- Enabled the ability to middle mouse click players on the top bar\n- Fixed Shiv's Killing Blow sometimes sending him into orbit\n- Fixed Shiv's Killing Blow continuing to do damage while being teleported by Quantum Entanglement\n- Fixed Quantum Entanglement's camera position anims not being smooth\n- Yamato's Flying Strike now also cancels when the target is out of world (like with Quantum Entanglement)\n- Fixed Pausing not working when using hero specific key binds\n- Lash's Death Slam now has clearer visual states to indicate when someone is successfully locked in\n- Fixed some cases where Grey Talon's trap effects would be stuck in the world\n- Updated ground strike preview cone to have a little more information on shape & outer bounds\n- Abandon Match is now only an available option once you have disconnected from the game server. Bringing up the menu while connected to a game now gives you the option to Disconnect rather than Abandon immediately\n- Fixed issues with Bots not using ziplines properly\n- Added Return Fire proc sound\n- Added Metal Skin proc sound\n- Updated McGinnis Heavy Barrage sound\n- Added Guardian and Walker death notification sound for all players\n- Improved panning resolution of bullet whizby sounds and shortened the max play distance to the local player\n- Fixed hero death UI sound playing inconsistently\n- Added bullet evasion sound effects\n- Updated Kelvin weapon fire audio\n- Updated Infernus weapon fire audio\n- Improved clarity for hero roster selection VO\n- Walker laser animation updated slightly, raising the forearms to better reveal the eye socket weakpoint to players on the ground\n- Re-enabled weapon-specific reload sounds\n- Abrams Life Siphon fades to 50% opacity after initial start to improve visibility\n- Added Healing Rite cast sound\n- Added Rescue Beam heal and pull loop sounds\n- Added Health Nova cast sound\n- Added Return Fire cast sound\n- Revised Metal Skin cast sound\n- Added Colossus cast and loop sounds\n- Added echo to Echo Shard cast sound\n- Added Silence Glyph cast and hit sounds\n- Added Ammo Scavenger proc sound\n- Added Restorative Shot proc sound\n- Added Toxic Bullets proc variations\n- Added a distance fade to Soul Shredder debuff effect and tweaked colors to reduce visual noise\n- Improved visibility on Spiritual Overflow effects when heroes are airborne\n- Reworked visual effects for puddle punch\n- Updated \"getting started\" VO for the ability points tab to match the text\n- Fixed a bunch of bugs that were impacting how VO was playing in a match.  Now a bunch of hero VO that was previously getting squashed/cut off should play properly (for instance certain lines where allies commented on ability usage, the patrons giving compliments for assists/team healing, etc).\n- The patron once again will warn you when your Walkers are under attack\n- The patron now will sometimes offer words of encouragement when you level up instead of when you destroy a Guardian or Walker\n- Increased the time you need to carry the urn before the urn nags about not being delivered\n- Fixed more instances of the wrong name for a hero being called out\n- If you're Dynamo or Krill, you can now ping during your ult to alert your allies\n- Mirage still loves the Djinn, but he yells about them less frequently\n- Added new custom charge and light melee and parry animations for Bebop\n- Added improvements for meleeing while using Siphon Life (book now floats and hand makes a fist)\n- Updated Grey Talon root effect for trap\n- Updated Grey Talon updated firing, projectile, impact effects\n- Updated Rain of Arrows effects\n- New heavy melee anims added to Mo & Krill and Ivy\n- Adjusted Trooper tracer and muzzle effects for better alignment and lower visual noise\n- Adjusted Lady Geist Life Drain to lower visual obstruction but increase awareness when it first latches\n- Inferno Catalyst effect revisions to help show range better\n- Trooper death effects resolve quicker and more cleanly\n- Mirage Djinn's Mark effects revisions to reduce noise on the victim and appear more clearly for Mirage\n- Soul jar effect carry and dropoff revisions to reduce visual noise for carrier\n- New Imports Building\n- New Taxi Stand building\n- Replaced old retaining wall\n- Replaced block-in park bridges\n[ Misc Gameplay ]\n- Troopers attack range vs Lane Guardians reduced from 13.5m to 12m (they get closer to it)\n- Players now need to be within 19m (above the ramp) to attack a Lane Guardian\n- Guardians now take 70% less damage from troopers at the start of the game; this reduces by 10% per minute (max at +30% increased damage at 10 min)\n- Guardian damage vs players increased by 20%\n- Medium Camps spawn time changed from 7 min to 5 min\n- Hard Camps spawn time changed from 7 min to 8 min\n- Teleporters open time changed from 10 min to 8 min\n- Trooper spawn/bounty lane end time changed from 10 min to 8 min\n- Vaults spawn time/interval changed from 10/5 to 8/4\n- Golden Statues and Breakables spawn time changed from 3 min to 2 min\n- Golden Statues bonuses upgrade time changed from 15 min to 10 min\n- Golden Statue Health buff increased from 15/20 to 20/30\n- Golden Statues now have a tier 3 upgrade at 25 minutes (+2.5% Fire Rate, +8% Ammo, 1.5% CD Reduction, +7% Weapon Damage, 40 Health, +5 Spirit Power)\n- Mid Boss now has 15 regen\n- Mid Boss creep buff rescaled from 70% to 50/70/90% for the 1/2/3rd mid boss death (further deaths don't increase)\n- Mid Boss rejuv respawn rescaled from 50% to 40/50/60% for the 1/2/3rd mid boss death (further deaths don't increase)\n- Urn now causes the runner to be revealed on the minimap\n- Heavy Melee against the urn runner now causes them to drop the urn\n- Urn delivery now gives each player on your team a Golden Statue permanent buff\n- Urn bounty increased by 15%\n- Urn now falls down from the sky a little bit faster\n- Comeback formula weighted a bit less on team vs team net worth calculation and more on the strength of the dying hero (regardless of lead)\n- Percentage of deniable orbs from objectives for Guardian/Walker/Patron/Shrines rescaled from 54.55/66.67/100/0% to 35%\n- Shields no longer reduce damage or get depleted by NPC units (Troopers, Bosses etc, but still takes damage from player summoned units)\n- All heroes' movespeed increased by 0.3 (Enduring Speed reduced by 0.3)\n- Bullet and Spirit Lifesteal now stack diminishingly\n- Teleporters now grant +3 m/s for 5s after arriving at the other side\n- Updated teleporter locations\n- Moved teleporters to travel between outer lane Walkers\n- Added teleporters in the underground tunnels\n- Changed underground teleporters to go between Subway and Tunnel on the same side of the map\n- Widened stairs from Shrines back to the player spawn area\n- Added ledge to mantle back up to the player spawn area from the pit\n- Added bridge and stair to the upper level of the Subway Entrance building from the outer lane Walker arenas\n- Added upper level connection through the Subway Entrance building\n- Moved Guardians back slightly further from stairs down to the canal\n- Widened channels surrounding Mid Temple slightly\n- Widened archways between Mid Temple channels\n- Garage and Night Club: Changed ropes so that they take you to the second floor and added back stairs to take you to the roof\n[ Weapon Items ]\n- Monster Rounds: Weapon Damage vs NPCs reduced from 35% to 30%\n- Restorative Shot: Weapon Damage reduced from 8% to 7%\n- Basic Magazine: Ammo increased from 24% to 26%\n- Melee Charge: Cooldown increased from 10.5s to 16s\n- Long Range: Ammo increase from 20% to 25%\n- Tesla Bullets: Spirit scaling increased from 0.13 to 0.16\n- Alchemical Fire: Now behaves like other grenades and does not bounce off walls\n- Alchemical Fire: Base DPS increased from 45 to 55\n- Toxic Bullets: Buildup is now 15% slower\n- Frenzy: Low HP threshold increased from 40% to 50%\n- Ricochet: Range reduced from 14m to 11m\n- Silencer: Spirit Power increased from 12 to 18\n- Vampiric Burst: Added ammo on active increased from +50% to +75%\n- Vampiric Burst: Cooldown reduced from 37s to 34s\n- Spiritual Overflow: No longer grants +20% Fire Rate\n- Spiritual Overflow: Upon full build-up, grants +35% Fire Rate\n- Spiritual Overflow: Activated Spirit Power increased from +45 to +50\n[ Vitality Items ]\n- Healing Rite: Regen duration increased from 17s to 19s (same total heal)\n- Extra Regen: Regen increased from 2.8 to 3\n- Extra Regen: Ammo increased from 8% to 10%\n- Extra Stamina: Stamina Recovery increased from 14% to 16%\n- Extra Stamina: Fire Rate reduced from 7% to 6%\n- Extra Stamina: Now gives +25 Health\n- Extra Health: Weapon Damage increased from 5% to 6%\n- Enduring Speed: Movespeed bonus reduced from 1.4 to 1.1 (all heroes movement speed increased by 0.3)\n- Enduring Speed: Slow resist reduced from 40% to 35%\n- Restorative Locket: Spirit Resist increased from 8% to 10%\n- Restorative Locket: Now grants +1 Sprint\n- Return Fire: Cooldown increased from 25s to 30s\n- Return Fire: Active bullet resist reduced from 25% to 20%\n- Health Nova: Spirit Power increased from +4 to +6\n- Combat Barrier: Weapon Damage reduced from 25% to 22%\n- Fortitude: Health increased from +300 to +325\n- Lifestrike: Heal increased from 55% of melee damage to 65%\n- Superior Stamina: Stamina Recovery increased from 20% to 25%\n- Veil Walker: Speed increased from 3 to 4\n- Majestic Leap: Cooldown increased from 23s to 26s\n- Rescue Beam: Cast range reduced from 36m to 32m\n- Leech: Weapon Damage increase from +15% to +20%\n- Leech: Spirit Power increased from +12 to +18\n- Siphon Bullets: HP Steal Per Bullet increased from 45 to 50\n[ Spirit Items ]\n- Extra Spirit: Spirit Power increased from 9 to 10\n- Ammo Scavenger: Spirit Power Per Soul reduced from 2 to 1\n- Ammo Scavenger: Max Stacks increased from 10 to 20\n- Withering Whip: No longer grants +50 Health\n- Withering Whip: Now grants +100 Bullet Shield\n- Withering Whip: Cooldown reduced from 26s to 22s\n- Cold Front: Cooldown reduced from 34s to 28s\n- Mystic Vulnerability: Fixed it stacking with Escalating Exposure\n- Slowing Hex: Slow reduced from 30% to 25%\n- Improved Spirit: Spirit Power increased from +23 to +28\n- Improved Burst: Max Health damage reduced from 9% to 7%\n- Knockdown: Cooldown reduced from 48s to 40s\n- Ethereal Shift: Can no longer end it early\n- Torment Pulse: Pulse interval is now fixed and does not get reduced with cooldown reduction\n- Superior Cooldown: Now grants +100 Spirit Shield\n- Escalating Exposure: Spirit Resist On Damage reduced from -15% to -12%\n- Escalating Exposure: Amp Per Stack reduced from 6% to 5%\n- Escalating Exposure: Duration reduced from 15s to 12s\n- Refresher: Cooldown increased from 212s to 230s\n- Mystic Reverb: Slow reduced from 50% to 40%\n[ Hero Changes ]\n- Abrams: Base health reduced from 600 to 570\n- Abrams: Health per boon increased from 32 to 34 (1048 vs 1046 total)\n- Abrams: Fixed shoulder charge sensitivity bugs that allowed you to turn more than intended\n- Abrams: Seismic Impact now allows for some very minor movement to help nudge around small objects\n- Bebop: Sticky Bomb growth increased from 2.5% to 4% per stack\n- Bebop: Sticky Bomb now loses 2 stacks on death\n- Bebop: Sticky Bomb now has 15 max stacks\n- Bebop: Hook range increased from 25m to 30m\n- Bebop: Hook now also hits enemy troopers, killing them instantly\n- Bebop: Fixed some cases where Hook would grab players from around corners\n- Bebop: Hyper Beam movement slow reduced from 30% to 25%\n- Bebop: Hyper Beam duration no longer scales with Spirit Power\n- Bebop: Hyper Beam duration increased from 8s to 10s\n- Bebop: Uppercut now applies a 15% Fire Rate slow in the landing radius for 5s. Scales with Spirit Power (0.2)\n- Dynamo: Quantum Entanglement cooldown increased from 12.5s to 15s\n- Dynamo: Quantum Entanglement T3 now also also reduces cooldown by 4s\n- Dynamo: Fixed Kinetic Pulse T2 tooltip to clarify that it affects bullets only and not melee damage\n- Grey Talon: Arrow cycle time increased from 0.45s to 0.55s (overall dps unchanged)\n- Grey Talon: Fixed Rain of Arrows alternate cast causing you to hit the ground soon after cast\n- Grey Talon: Fixed Guided Owl colliding with nearby objects during cast\n- Grey Talon: Fire Rate no longer scales with Spirit Power\n- Grey Talon: Base bullet damage now scales with Spirit Power (0.1)\n- Grey Talon: Guided Owl 3s grace period for kill increased to 4s\n- Grey Talon: Fixed Guided Owl grace period still requiring that he gets the kill, rather than the target just die\n- Grey Talon: Movespeed no longer scales with Spirit Power\n- Grey Talon: Base stamina increased from 3 to 4\n- Haze: Fixation max stacks increased from 30 to 40\n- Haze: Fixation T3 reduced from +0.2 to +0.15\n- Haze: Bullet Dance no longer grants +15% Fire Rate\n- Haze: Bullet Dance base ability now grants 2 Targets Hit Per Shot\n- Haze: Bullet Dance base ability no longer grants +25% Evasion\n- Haze: Bullet Dance T3 now grants +40% Evasion and +2 Bullet Dance Speed\n- Infernus: Catalyst Damage Amp reduced from 25% to 20%\n- Infernus: Catalyst T3 Damage Amp increased from 15% to 20%\n- Ivy: Improved default camera position\n- Ivy: Take Flight control keys are now similar to Vindicta's\n- Ivy: Fixed some issues with control on Take Flight when near a wall\n- Lady Geist: Fixed a bug that could cause some units to take more damage than intended with Essence Bomb when multiple targets are hit\n- Lady Geist: Life Drain can now be alternate-casted on allied heroes\n- Lady Geist: Added double tap accidental protection for Life Drain to help against instant cancellations\n- Lady Geist: Malice slow duration reduced from 6s to 4s\n- Lady Geist: Malice amp duration reduced from 16s to 13s\n- Lady Geist: You can now see how many Malice stacks you have on you as the opponent\n- Lash: Base bullet damage reduced from 10 to 9\n- Lash: Flog Heal vs heroes reduced from 80% to 70%\n- Lash: Flog Heal vs creeps reduced from 30% to 25%\n- McGinnis: No longer has +25% Spirit Resist\n- McGinnis: Now has +15% Bullet Resist\n- McGinnis: Mini Turrets T1 no longer grants +1 charge\n- McGinnis: Mini Turrets duration reduced from 30s to 24s\n- McGinnis: Mini Turrets cooldown reduced from 30s to 24s\n- McGinnis: Mini Turrets health scaling reduced from 30% to 20%\n- McGinnis: Mini Turrets recharge time reduced from 5s to 3s\n- McGinnis: Mini Turrets cast range increased from 15m to 20m\n- McGinnis: Mini Turret damage reduction against troopers/neutrals increased from -40% to -50%\n- McGinnis: Mini Turret damage reduction against objectives increased from -60% to -70%\n- McGinnis: Fixed Ricochet not bouncing off of Mini Turrets\n- McGinnis: Mini Turret spawn time reduced from 1s to 0.25s\n- McGinnis: Mini Turret attack delay reduced from 0.35s to 0.2s\n- McGinnis: Heavy Barrage radius increased from 4.5m to 5m\n- Mirage: Tornado now uses a range for its travel distance instead of a travel duration (scales with range increase)\n- Mirage: Enemies that have already been hit by Fire Scarabs now let the next scarab projectile pass through them\n- Mirage: Djinn's Mark base damage reduced from 16 to 12\n- Mirage: Djinn's Mark scaling from spirit power increased from 0.4 to 0.55\n- Mirage: Djinn's Mark reveal duration increased from 2s to 3s\n- Mirage: Traveler now causes your camera to move to the destination during the channel\n- Mirage: Traveler T1 is now \"+2 m/s\" (was -20s cd)\n- Mirage: Traveler T2 is now \"-30s cd\" (was +2 m/s)\n- Mirage: Traveler T3 fire rate increased from 20% to 30%\n- Mo & Krill: Combo T1 now grants +30% Bullet Resist While Channeling (no longer grants -28s CD)\n- Mo & Krill: Combo cooldown reduced from 95s to 75s\n- Paradox: Bullet growth per boon increased from 0.33 to 0.45\n- Paradox: Time Wall bullet duration reduced from 1s to 0.7s\n- Paradox: Fixed Time Wall not being spawned when looking down while casting\n- Paradox: Paradoxical Swap cooldown increased from 48s to 65s\n- Paradox: Paradoxical Swap range reduced from 30m to 25m\n- Paradox: Paradoxical Swap T1 now reduces cooldown by 15s\n- Paradox: Paradoxical Swap T3 now increases range by 20m\n- Paradox: Pulse Grenade radius reduced from 7m to 6m\n- Paradox: Pulse Grenade Damage Amp per Stack increased from 5% to 6%\n- Paradox: Pulse Grenade T3 no longer increases Damage Amp by 2%\n- Paradox: Pulse Grenade T3 now also increases the radius by 1m per pulse\n- Pocket: Shotgun falloff start reduced from 22m to 16m\n- Pocket: Enchanter's Satchel damage now respects line of sight\n- Pocket: Enchanter's Satchel now shows an aoe indicator for Pocket while channeling\n- Pocket: Affliction DPS Spirit Power scaling reduced from 0.4 to 0.34\n- Pocket: Barrage radius reduced from 6.5m to 4.5m\n- Pocket: Barrage T3 now also increases radius by 2m\n- Seven: Base regen increased from 1.5 to 3\n- Seven: Movespeed scaling with Spirit Power reduced from 0.028 to 0.02\n- Seven: Lightning Ball T3 increased from +1m to +2m\n- Shiv: Slice and Dice Spirit damage scaling increased from 1.2 to 1.3\n- Shiv: Slice and Dice T1 improved from -3.75s to -4s\n- Shiv: Rage decay rate reduced from 0.35 to 0.25\n- Shiv: Rage buffer duration increased from 7s to 12s (how long it stays before starting to decay)\n- Vindicta: Reverted recent falloff damage changes\n- Vindicta: Fall off increased from 58m (default) to 64m\n- Vindicta: Bullet damage growth per boon reduced from 0.79 to 0.55\n- Vindicta: Flight duration no longer scales with Spirit Power\n- Vindicta: Flight T2 now increases flight duration by 6s\n- Vindicta: Flight bonus move speed above base now scales at 50% effectiveness\n- Vindicta: No longer has -10% base bullet resist\n- Vindicta: Health growth per boon reduced from 20 to 15\n- Vindicta: Gun cycle time increased from 0.22 to 0.26 (dps rescaled to remain the same, after the above changes are calculated in)\n- Vindicta: Stake duration reduced from 2s to 1.75s\n- Vindicta: Assassinate bonus souls is now unsecured\n- Vindicta: Shooting while flying now has similar speed impact as on the ground\n- Vindicta: Flight air acceleration decreased a little\n- Vindicta: Crow Familiar % damage no longer affects Mid Boss\n- Viscous: Goo Ball no longer triggers on hit effect while in Ethereal Shift\n- Viscous: Fixed Superior Stamina dash count not working with Goo Ball\n- Viscous: Goo Ball stun duration reduced from 1s to 0.7s\n- Viscous: Splatter base damage reduced from 100 to 90\n- Viscous: Splatter T2 reduced from +70 to +60\n- Viscous: Splatter Spirit damage scale increased from 1.5 to 1.9\n- Viscous: Fixed Instant Cast not working for Puddle Punch\n- Warden: Alchemical Flask cooldown reduced from 14s to 12s\n- Warden: Alchemical Flask damage increased from 55 to 65\n- Warden: Alchemical Flask T1 is now +1 Stamina Reduction\n- Warden: Alchemical Flask T2 is now +50 Damage\n- Warden: Last Stand channel duration reduced from 2.2s to 2s\n- Warden: Last Stand range increased from 12m to 13m\n- Wraith: Card Trick spirit scale reduced from 1.2 to 1.1\n- Wraith: Card Trick generation via melee reduced by 50%\n- Yamato: Power Slash cooldown increased from 8.5s to 10.5s\n- Yamato: Power Slash T2 now also reduces cooldown by 2s\n- Yamato: Shadow Transformation no longer grants you bullet and spirit resist\n- Yamato: Shadow Transformation duration reduced from 4.5s to 4s",
    "hero_patch_notes": [
        "- Yamato's Flying Strike now also cancels when the target is out of world (like with Quantum Entanglement)",
        "- Lash's Death Slam now has clearer visual states to indicate when someone is successfully locked in",
        "- Abrams Life Siphon fades to 50% opacity after initial start to improve visibility",
        "- Mirage still loves the Djinn, but he yells about them less frequently",
        "- Mirage Djinn's Mark effects revisions to reduce noise on the victim and appear more clearly for Mirage",
        "- Abrams: Base health reduced from 600 to 570",
        "- Abrams: Health per boon increased from 32 to 34 (1048 vs 1046 total)",
        "- Abrams: Fixed shoulder charge sensitivity bugs that allowed you to turn more than intended",
        "- Abrams: Seismic Impact now allows for some very minor movement to help nudge around small objects",
        "- Bebop: Sticky Bomb growth increased from 2.5% to 4% per stack",
        "- Bebop: Sticky Bomb now loses 2 stacks on death",
        "- Bebop: Sticky Bomb now has 15 max stacks",
        "- Bebop: Hook range increased from 25m to 30m",
        "- Bebop: Hook now also hits enemy troopers, killing them instantly",
        "- Bebop: Fixed some cases where Hook would grab players from around corners",
        "- Bebop: Hyper Beam movement slow reduced from 30% to 25%",
        "- Bebop: Hyper Beam duration no longer scales with Spirit Power",
        "- Bebop: Hyper Beam duration increased from 8s to 10s",
        "- Bebop: Uppercut now applies a 15% Fire Rate slow in the landing radius for 5s. Scales with Spirit Power (0.2)",
        "- Dynamo: Quantum Entanglement cooldown increased from 12.5s to 15s",
        "- Dynamo: Quantum Entanglement T3 now also also reduces cooldown by 4s",
        "- Dynamo: Fixed Kinetic Pulse T2 tooltip to clarify that it affects bullets only and not melee damage",
        "- Grey Talon: Arrow cycle time increased from 0.45s to 0.55s (overall dps unchanged)",
        "- Grey Talon: Fixed Rain of Arrows alternate cast causing you to hit the ground soon after cast",
        "- Grey Talon: Fixed Guided Owl colliding with nearby objects during cast",
        "- Grey Talon: Fire Rate no longer scales with Spirit Power",
        "- Grey Talon: Base bullet damage now scales with Spirit Power (0.1)",
        "- Grey Talon: Guided Owl 3s grace period for kill increased to 4s",
        "- Grey Talon: Fixed Guided Owl grace period still requiring that he gets the kill, rather than the target just die",
        "- Grey Talon: Movespeed no longer scales with Spirit Power",
        "- Grey Talon: Base stamina increased from 3 to 4",
        "- Haze: Fixation max stacks increased from 30 to 40",
        "- Haze: Fixation T3 reduced from +0.2 to +0.15",
        "- Haze: Bullet Dance no longer grants +15% Fire Rate",
        "- Haze: Bullet Dance base ability now grants 2 Targets Hit Per Shot",
        "- Haze: Bullet Dance base ability no longer grants +25% Evasion",
        "- Haze: Bullet Dance T3 now grants +40% Evasion and +2 Bullet Dance Speed",
        "- Infernus: Catalyst Damage Amp reduced from 25% to 20%",
        "- Infernus: Catalyst T3 Damage Amp increased from 15% to 20%",
        "- Ivy: Improved default camera position",
        "- Ivy: Take Flight control keys are now similar to Vindicta's",
        "- Ivy: Fixed some issues with control on Take Flight when near a wall",
        "- Lady Geist: Fixed a bug that could cause some units to take more damage than intended with Essence Bomb when multiple targets are hit",
        "- Lady Geist: Life Drain can now be alternate-casted on allied heroes",
        "- Lady Geist: Added double tap accidental protection for Life Drain to help against instant cancellations",
        "- Lady Geist: Malice slow duration reduced from 6s to 4s",
        "- Lady Geist: Malice amp duration reduced from 16s to 13s",
        "- Lady Geist: You can now see how many Malice stacks you have on you as the opponent",
        "- Lash: Base bullet damage reduced from 10 to 9",
        "- Lash: Flog Heal vs heroes reduced from 80% to 70%",
        "- Lash: Flog Heal vs creeps reduced from 30% to 25%",
        "- McGinnis: No longer has +25% Spirit Resist",
        "- McGinnis: Now has +15% Bullet Resist",
        "- McGinnis: Mini Turrets T1 no longer grants +1 charge",
        "- McGinnis: Mini Turrets duration reduced from 30s to 24s",
        "- McGinnis: Mini Turrets cooldown reduced from 30s to 24s",
        "- McGinnis: Mini Turrets health scaling reduced from 30% to 20%",
        "- McGinnis: Mini Turrets recharge time reduced from 5s to 3s",
        "- McGinnis: Mini Turrets cast range increased from 15m to 20m",
        "- McGinnis: Mini Turret damage reduction against troopers/neutrals increased from -40% to -50%",
        "- McGinnis: Mini Turret damage reduction against objectives increased from -60% to -70%",
        "- McGinnis: Fixed Ricochet not bouncing off of Mini Turrets",
        "- McGinnis: Mini Turret spawn time reduced from 1s to 0.25s",
        "- McGinnis: Mini Turret attack delay reduced from 0.35s to 0.2s",
        "- McGinnis: Heavy Barrage radius increased from 4.5m to 5m",
        "- Mirage: Tornado now uses a range for its travel distance instead of a travel duration (scales with range increase)",
        "- Mirage: Enemies that have already been hit by Fire Scarabs now let the next scarab projectile pass through them",
        "- Mirage: Djinn's Mark base damage reduced from 16 to 12",
        "- Mirage: Djinn's Mark scaling from spirit power increased from 0.4 to 0.55",
        "- Mirage: Djinn's Mark reveal duration increased from 2s to 3s",
        "- Mirage: Traveler now causes your camera to move to the destination during the channel",
        "- Mirage: Traveler T1 is now \"+2 m/s\" (was -20s cd)",
        "- Mirage: Traveler T2 is now \"-30s cd\" (was +2 m/s)",
        "- Mirage: Traveler T3 fire rate increased from 20% to 30%",
        "- Mo & Krill: Combo T1 now grants +30% Bullet Resist While Channeling (no longer grants -28s CD)",
        "- Mo & Krill: Combo cooldown reduced from 95s to 75s",
        "- Paradox: Bullet growth per boon increased from 0.33 to 0.45",
        "- Paradox: Time Wall bullet duration reduced from 1s to 0.7s",
        "- Paradox: Fixed Time Wall not being spawned when looking down while casting",
        "- Paradox: Paradoxical Swap cooldown increased from 48s to 65s",
        "- Paradox: Paradoxical Swap range reduced from 30m to 25m",
        "- Paradox: Paradoxical Swap T1 now reduces cooldown by 15s",
        "- Paradox: Paradoxical Swap T3 now increases range by 20m",
        "- Paradox: Pulse Grenade radius reduced from 7m to 6m",
        "- Paradox: Pulse Grenade Damage Amp per Stack increased from 5% to 6%",
        "- Paradox: Pulse Grenade T3 no longer increases Damage Amp by 2%",
        "- Paradox: Pulse Grenade T3 now also increases the radius by 1m per pulse",
        "- Pocket: Shotgun falloff start reduced from 22m to 16m",
        "- Pocket: Enchanter's Satchel damage now respects line of sight",
        "- Pocket: Enchanter's Satchel now shows an aoe indicator for Pocket while channeling",
        "- Pocket: Affliction DPS Spirit Power scaling reduced from 0.4 to 0.34",
        "- Pocket: Barrage radius reduced from 6.5m to 4.5m",
        "- Pocket: Barrage T3 now also increases radius by 2m",
        "- Seven: Base regen increased from 1.5 to 3",
        "- Seven: Movespeed scaling with Spirit Power reduced from 0.028 to 0.02",
        "- Seven: Lightning Ball T3 increased from +1m to +2m",
        "- Shiv: Slice and Dice Spirit damage scaling increased from 1.2 to 1.3",
        "- Shiv: Slice and Dice T1 improved from -3.75s to -4s",
        "- Shiv: Rage decay rate reduced from 0.35 to 0.25",
        "- Shiv: Rage buffer duration increased from 7s to 12s (how long it stays before starting to decay)",
        "- Vindicta: Reverted recent falloff damage changes",
        "- Vindicta: Fall off increased from 58m (default) to 64m",
        "- Vindicta: Bullet damage growth per boon reduced from 0.79 to 0.55",
        "- Vindicta: Flight duration no longer scales with Spirit Power",
        "- Vindicta: Flight T2 now increases flight duration by 6s",
        "- Vindicta: Flight bonus move speed above base now scales at 50% effectiveness",
        "- Vindicta: No longer has -10% base bullet resist",
        "- Vindicta: Health growth per boon reduced from 20 to 15",
        "- Vindicta: Gun cycle time increased from 0.22 to 0.26 (dps rescaled to remain the same, after the above changes are calculated in)",
        "- Vindicta: Stake duration reduced from 2s to 1.75s",
        "- Vindicta: Assassinate bonus souls is now unsecured",
        "- Vindicta: Shooting while flying now has similar speed impact as on the ground",
        "- Vindicta: Flight air acceleration decreased a little",
        "- Vindicta: Crow Familiar % damage no longer affects Mid Boss",
        "- Viscous: Goo Ball no longer triggers on hit effect while in Ethereal Shift",
        "- Viscous: Fixed Superior Stamina dash count not working with Goo Ball",
        "- Viscous: Goo Ball stun duration reduced from 1s to 0.7s",
        "- Viscous: Splatter base damage reduced from 100 to 90",
        "- Viscous: Splatter T2 reduced from +70 to +60",
        "- Viscous: Splatter Spirit damage scale increased from 1.5 to 1.9",
        "- Viscous: Fixed Instant Cast not working for Puddle Punch",
        "- Warden: Alchemical Flask cooldown reduced from 14s to 12s",
        "- Warden: Alchemical Flask damage increased from 55 to 65",
        "- Warden: Alchemical Flask T1 is now +1 Stamina Reduction",
        "- Warden: Alchemical Flask T2 is now +50 Damage",
        "- Warden: Last Stand channel duration reduced from 2.2s to 2s",
        "- Warden: Last Stand range increased from 12m to 13m",
        "- Wraith: Card Trick spirit scale reduced from 1.2 to 1.1",
        "- Wraith: Card Trick generation via melee reduced by 50%",
        "- Yamato: Power Slash cooldown increased from 8.5s to 10.5s",
        "- Yamato: Power Slash T2 now also reduces cooldown by 2s",
        "- Yamato: Shadow Transformation no longer grants you bullet and spirit resist",
        "- Yamato: Shadow Transformation duration reduced from 4.5s to 4s"
    ],
    "flagged_entries": [
        "- Certain heroes now have a higher priority at being in dual lanes (Ivy and Dynamo atm)",
        "- Replaced the temp Yamato VO with a new translation spoken by a native actress",
        "- Fixed Shiv's Killing Blow sometimes sending him into orbit",
        "- Fixed Shiv's Killing Blow continuing to do damage while being teleported by Quantum Entanglement",
        "- Fixed some cases where Grey Talon's trap effects would be stuck in the world",
        "- Updated McGinnis Heavy Barrage sound",
        "- Updated Kelvin weapon fire audio",
        "- Updated Infernus weapon fire audio",
        "- If you're Dynamo or Krill, you can now ping during your ult to alert your allies",
        "- Added new custom charge and light melee and parry animations for Bebop",
        "- Updated Grey Talon root effect for trap",
        "- Updated Grey Talon updated firing, projectile, impact effects",
        "- New heavy melee anims added to Mo & Krill and Ivy",
        "- Adjusted Lady Geist Life Drain to lower visual obstruction but increase awareness when it first latches"
    ]
}