{
    "poster": "Yoshi",
    "date": "Jun 20, 2024",
    "time": "1:51 PM",
    "content": "[ General Changes ]\n\n\n\n- Added EU servers and matchmaking region. EU testing times are Mon-Thur 5PM to 3AM and Fri-Sun 3PM to 3AM. Times listed are Central European Summer Time (GMT+2).\n\n\n\n- Removed the invite requirement of Steam friends having been on your list for a number of days (affected normal user cases often where friends weren't on the Steam list, and we have other metrics and tools on the backend now that we can use to filter for other cases)\n\n- Added search functionality to the shop. You can now search by item name or by individual stat such as 'Ammo', 'Lifesteal', or 'Spirit Power'.\n\n- The game will now let you know when it is safe to abandon (usually if one person has been disconnected for a while)\n\n\n\n- Your personal builds are now always sorted to the top of the in-game Builds dropdown\n\n- Various network related improvements when there is packet loss\n\n- Preferred heroes in your roster are now remember on the client across sessions\n\n- Fixed chat wheel not working during the post-game sequence\n\n\n\n- Updated the entrance to the underground tunnels from the outer lanes to look more like a subway entrance\n\n- Re-enabled ultra wide UI mode\n\n- Added street names and symbols to the Zipline UI\n\n- Updated Sleep Dagger and Silence Glyph tooltips to clarify that they do not cancel channeling abilities\n\n- Updated reload animations for Warden, Dynamo, and Ivy\n\n- Improved visibility of Inferno's Concussive Combustion\n\n- Fixed the unit target UI not showing up for instant-cast abilities (MoKrill ult, Lady Geist ult, Bebop bomb)\n\n- Fixed the unit target UI not showing the activation button hint\n\n- Added a Cosmic Veil to the hero demo map\n\n- Added Ethereal Shift sounds\n\n- Added wind sound when on the Zipline\n\n\n\n\n\n\n\n[ Misc Gameplay ]\n\n\n\n- Rejuv buff is now only granted to the players that are alive. Players that are dead will have their respawn times cut in half from their current values.\n\n\n\n- Footsteps are now quieter when obstructed by level geometry\n\n- Dash-Down is now double tap CTRL instead of CTRL+SHIFT\n\n- Vault bounty increased from 300 to 330\n\n- Fixed various bugs with Headshot Booster and Sharpshooter\n\n\n\n- Added another entrance/exit to the underground tunnels from the warehouse interiors\n\n- Enclosed the exterior Medium Neutral Camp with fencing in front of the Theater to match the Amber side Cab Stand\n\n- Added two more veils on each side:\n\n  1) Between the Drug Store and the Market on Amber, between the Hotel and Pharmacy on Sapphire\n\n  2) Between the exterior Strong Neutral Camps and the outer lane near the T2\n\n\n\n\n\n\n\n[ Item Gameplay ]\n\n\n\n- Added a new T1 Spirit item, Infuser\n\n    +8% Spirit Resist\n\n    +10% Ammo\n\n    Active: Gain 12 Spirit and 20% Spirit Lifesteal for 6 seconds. Cooldown: 35s\n\n\n\n\n\n- Added a new T1 Weapon item, Ammo Scavenger\n\n    +20% Ammo\n\n    +50 Health\n\n    Passive: Anytime you secure or deny a Soul, you get 2 ammo back and have +20% Fire Rate for 4 seconds.\n\n\n\n\n\n- Added a new T2 Weapon item, Active Reload\n\n    -20% Reload Time\n\n    +8% Weapon Damage\n\n    Passive: Pressing the reload key during the halfway point of a reload will cause you to instantly regain your magazine and grant you +30% Bullet Lifesteal and +15% Fire Rate for 6s. The reload UI has an indicator for the trigger window. Cooldown: 25s\n\n\n\nInspired by \nhttps://project8.dev/threads/item-idea-trick-reload.2652/\n\n\n\n\n\n- Added a new T2 Weapon item, Veil Walker\n\n    +15% Ammo\n\n    +8% Weapon Damage\n\n    +200 Bullet Shield\n\n    - Passive: Walking through a Cosmic Veil causes you to become invisible with +3 m/s for 4 seconds and grants you +30% Fire Rate for your next magazine. Cosmic Veils regenerate any shields you have. Cooldown: 20s\n\n\n\n\n\n- Added a new T2 Weapon item, Melee Charge\n\n    +15% Melee Damage\n\n    +10% Weapon Power\n\n    +75 Health\n\n    Passive: Hitting an enemy with a heavy melee reloads your weapon\n\n    Passive: Increases your heavy melee charge distance by 40%\n\n\n\nInspired by \nhttps://project8.dev/threads/bayonet.5372/\n and \nhttps://project8.dev/threads/comple...-category-item-that-buffs-charged-melee.5957/\n\n\n\n\n\n- Added a new T4 Vitality item, Colossus\n\n    +500 HP\n\n    +20% Melee Damage\n\n    +20% Weapon Damage\n\n    Active: Gain 40% Bullet and Spirit Resist and apply 20% movement slow to enemies within 10m. Your model size grows by 10%. Lasts 7 seconds. Cooldown: 65s\n\n\n\n\n\n- Healing Rite: Duration increased from 15s to 17s (total regen increased from 350 to 370)\n\n- Extra Spirit: Spirit Power increased from +6 to +7\n\n- Extra Charge: Now grants +7% Cooldown Reduction For Charged Abilities\n\n- Extra Charge: No longer grants +6 Spirit to Charged Abilities\n\n\n\n- Swift Striker: Negative bullet resist reduced from -6% to -5%\n\n- Mystic Shot: Spirit scaling increased from 0.45 to 0.6\n\n- Enduring Speed: Slow resist increased from 35% to 40%\n\n- Enduring Speed: Now grants +1.5 HP Regen\n\n- Healing Booster: Spirit Resist reduced from 8% to 7%\n\n- Healing Booster: Now provides +7% Bullet Resist\n\n- Return Fire: Cooldown reduced from 30s to 24s\n\n- Restorative Locket: Fixed the max stack limit not being followed\n\n- Restorative Locket: Max stacks increased from 15 to 18\n\n- Bullet Resist Shredder: Bullet Resist Reduction increased from -10% to -12%\n\n- Bullet Resist Shredder: Bullet Resist Reduction duration increased from 5s to 6s\n\n- Decay: Cooldown reduced from 27s to 25s\n\n- Suppressor: Duration reduced from 4s to 2.5s\n\n\n\n- Mystic Slow: Duration increased from 2s to 2.5s\n\n- Titanic Magazine: Ammo increased from 65% to 75%\n\n- Ethereal Shift: Cooldown reduced from 35s to 30s\n\n- Rescue Beam: Cast range increased from 40m to 45m\n\n- Rescue Beam: Cooldown reduced from 45s to 40s\n\n- Silence Glyph: Cooldown reduced from 35s to 30s\n\n- Superior Stamina: Stamina increased from +2 to +3\n\n- Superior Stamina: Fire Rate increased from +12% to +15%\n\n- Superior Stamina: Spirit Bonus after 2nd jump/dash increased from +20 to +25\n\n- Lifestrike: Slow duration increased from 1.5s to 2s\n\n- Lifestrike: Heal increased from 40% of damage to 45%\n\n- Majestic Leap: Cooldown increased from 20s to 26s\n\n- Majestic Leap: Damage cooldown window increased from 4s to 5s\n\n- Majestic Leap: Fixed cooldown reduction affecting the damage cooldown\n\n- Knockdown: Cooldown reduced from 40s to 30s\n\n- Improved Spirit: Spirit Power increased from +15 to +18\n\n- Tesla: Bounce radius increased from 7m to 9m\n\n- Burst Fire: Now increases your slide distance and duration by 25%\n\n- Metal Skin: Now prevents all weapon damage instead of blocking bullets (this allows procs to go through)\n\n\n\n- Inhibitor: Moved from Weapon tree to Vitality\n\n- Inhibitor: No longer requires the component Slowing Bullets\n\n- Inhibitor: Now has +175 Health\n\n- Inhibitor: Weapon Damage reduced from 30% to 20%\n\n- Crippling Headshot: Bullet and Spirit Lifesteal reduced from 15% to 10%\n\n- Unstoppable: Active Spirit Resistance reduced from 40% to 20%\n\n- Ricochet: Ricochet Damage increased from 40% to 45%\n\n- Ricochet: Ammo increased from 30% to 35%\n\n- Vampiric Burst: Now grants +150 Health\n\n- Vampiric Burst: Weapon Damage increased from 20% to 25%\n\n- Vampiric Burst: Can now be cast while busy (such as while you are shooting)\n\n- Siphon Bullets: Max HP Steal increased from 40 to 45\n\n- Spiritual Overflow: Cooldown reduction increased from 10% to 15%\n\n- Spiritual Overflow: Bonus Spirit Power increased from +35 to +40\n\n- Frenzy: Low HP Spirit Resist increased from +25% to +30%\n\n- Frenzy: Fixed tooltip on Spirit Resist missing the %\n\n- Shadow Weave: Now grants +30% Ammo\n\n- Shadow Weave: Ambush Fire Rate increased from +50% to +60%\n\n- Shadow Weave: Ambush Spirit Power increased from +40 to +55\n\n- Shadow Weave: Invisibility no longer plays footstep sounds (general change)\n\n- Shadow Weave: Casting the item immediately puts you into Sprint mode\n\n- Leech: Now grants +7 Spirit\n\n- Mystic Reverb: Delayed damage increased from 30% to 40%\n\n- Boundless Spirit: Spirit Power increased from +55 to +60\n\n- Boundless Spirit: Bonus Health increased from +175 to +200\n\n\n\n\n\n\n\n[ Hero Gameplay ]\n\n\n\n- Abrams: Improved misc issues with Seismic Impact collision\n\n- Abrams: Seismic Impact can be held for up to 3 seconds. Press the ability again anytime to land.\n\n- Bebop: Hook hitbox reduced from 36 inches to 33\n\n- Bebop: Hyper Beam cooldown increased from 100s to 110s\n\n- Dynamo: Rejuvenating Aurora move speed increased from 3.8 to 4.2\n\n- Dynamo: Singularity T1 radius reduced from +3m to +2m\n\n- Dynamo: Singularity falls 70% slower when Majestic Leap down is used (similar to the hero falling slower normally when casting the ability from an elevation)  \n\n- Grey Talon: Fixed Charged Shot being evaded by Haze's Bullet Dance\n\n- Grey Talon: Rain of Arrows cooldown increased from 30s to 33s\n\n- Grey Talon: Guided Owl can now explode in the air by pressing the release key\n\n- Haze: Sleep Dagger cooldown reduced from 29s to 27s\n\n- Haze: Sleep Dagger T2 cooldown changed from -15s to -13s\n\n- Haze: Smoke Bomb T2 changed to \"Replenishes stamina on cast and grants +40% Stamina Regen\"\n\n- Haze: Fixation bonus damage no longer ignores bullet falloff\n\n- Haze: Bullet Dance cast point reduced from 0.8s to 0.4s\n\n- Haze: Bullet Dance move speed increased from 3.5 to 4\n\n- Infernus: Fixed Flame Dash duration not being affected by duration extender\n\n- Ivy: Kudzu Bomb now does 50% less damage to objectives\n\n- Kelvin: Arctic Beam movespeed limit is now applied via a reduction rather than a speed cap (to allow items to be combined for faster movement like Surge of Power)\n\n- Lady Geist: Essence Bomb no longer starts decaying the arm time while in the air\n\n- Lady Geist: Essence Bomb arm time reduced from 1s to 0.5s (this is a nerf for long distance bombs)\n\n- Lady Geist: Soul Exchange T3 changed to \"After swap gain +40% Fire Rate and +40% Spirit Resistance for 8s\"\n\n- Lash: Fixed it being possible to lose your full lock on with Death Slam sometimes if you look away\n\n- McGinnis: Turret range reduced from 30m to 25m\n\n- McGinnis: Turret HP scaling reduced from 40% to 30% (affects initial HP too)\n\n- McGinnis: Turret cooldown reduced from 35s to 30s\n\n- McGinnis: Turret Charge Time reduced from 8s to 6s\n\n- McGinnis: Base Spirit Resist increased from 20% to 25%\n\n- McGinnis: Base Regen increased from 1 to 2\n\n- McGinnis: Spectral Wall cooldown reduced from 35s to 30s\n\n- McGinnis: Heavy Barrage cooldown reduced from 110s to 100s\n\n- Mo & Krill: You can now cast items and Scorn while spinning out of Burrow\n\n- Mo & Krill: Combo bonus health per kill increased from 25 to 30\n\n- Paradox: Kinetic Carbine cooldown increased from 22s to 24s\n\n- Paradox: Paradoxical Swap cooldown increased from 35s to 45s\n\n- Pocket: Barrage base damage reduced from 40 to 35\n\n- Pocket: Barrage T1 reduced from +20 to +15\n\n- Pocket: Fixed a recent change causing Enchanter's Satchel to not play damage at the destination when teleporting with Flying Cloak\n\n- Seven: Static Charge now uses the new instant cast option that Bebop Bomb uses\n\n- Seven: Power Surge spirit scaling increased from 0.1 to 0.2 (new total with T3 is now from 0.5 to 0.6)\n\n- Vindicta: Crow Familiar debuff duration increased from 5s to 6s\n\n- Vindicta: Assassinate bonus damage increased from 130 to 145\n\n- Yamato: Shadow Transformation now provides 80% Damage Resistance and 80% Debuff Resistance instead of invulnerability during the post-channel buff\n\n- Yamato: Shadow Transformation cooldown reduced from 110s to 100s\n\n- Yamato: Shadow Transformation T3 increased from +1s to +1.5s"
}