{
    "poster": "Yoshi",
    "date": "Jul 4, 2024",
    "time": "2:16 PM",
    "content": "[ General Changes ]\n\n\n\n- Added Asia servers and matchmaking region. Testing times for this region are Mon-Thur 5PM to 3AM and Fri-Sun 3PM to 3AM in China Standard Time (GMT+8).\n\n\n\n- Added South America servers and matchmaking region. Testing times for this region are Mon-Thur 5PM to 3AM and Fri-Sun 3PM to 3AM in Atlantic Standard Time (GMT-4).\n\n\n\n- Added a new Damage Report feature. You can now open a flyout panel within the shop to view a breakdown of your hero's incoming and outgoing damage throughout the course of a match. You can also hover an enemy hero to view a quick breakdown of their key stats and items. The data can be filtered by last respawn, 10 minutes, 5 minutes, 3 minutes, 1 minute, or 30 seconds.\n\n\n\n- Reworked the top bar HUD to reduce overall height\n\n\n\n- While spectating or watching replays, the game now has a free cursor mode without needing to hold modifiers down (defaulted to on). Can toggle it off while spectating using the 'J' key.\n\n- Minimap now displays dead heroes for 5 seconds after their death\n\n\n\n- Reworked the default suggested items for heroes to be much more simple (oriented more strongly for new player onboarding)\n\n\n\n- Parties will now be a little more likely to be in the same lane, if there isn't a wide skill gap or other factors preventing it\n\n- All instances of collecting souls  (whether claiming your own or denying an opponent) will share the same sound. Being denied a soul orb by an enemy will have its own unique sound.\n\n- Fixed the HUD cooldown state thrashing while picking up the Soul Urn\n\n- Fixed Spectral Wall sometimes not spawning depending on the map geometry nearby\n\n- Added descriptive tooltips to Render and Audio options within settings. Render tooltips include an estimate of performance impact where applicable.\n\n- Fixed a bug where bullets could penetrate close range targets and hit 2 targets when not intended (was primarily obvious with neutral farming)\n\n- Reduced the end of match delay from 10s to 4s\n\n- Added a shatter sound effect for meleeing the mid boss rejuvenator\n\n- Added ghost models inside the doorways of the juke closets to help clarify which are dead ends\n\n- Fixed position of the \"All Walkers Destroyed\" Flex slot to be the 2nd slot rather than the 4th\n\n- Added a sound for when Infernus's Afterburn procs\n\n- Added rejuvenator pickup sound\n\n- Minimap now highlights Soul Urn dropoff location\n\n- Updated Wraith Full Auto cast sound\n\n- Added audio feedback for environmental damage\n\n- Fixed sounds associated with last hit playing unreliably\n\n- Updated sounds for Wraith Card Trick projectile, impact, and when you gain a card\n\n- Added traffic and construction ambient sounds and updated general ambience mix\n\n\n\n\n\n\n\n[ Misc Gameplay]\n\n\n\n- Urn count changed from 2 to 1 (previous souls value restored)\n\n- Urn pickup location moved to closer to the outer lanes (on the opposite side of the lane pillar, facing towards the bridge)\n\n- Urn drop-off location now move to the same spot as the pickup (opposite end of the map, depending on which location the Urn spawns in)\n\n- Urn pickup time reduced from 4s to 2s\n\n- Urn now has a 2s drop-off time\n\n- Urn no longer applies a 15% slow\n\n- Urn now prevents you from using the zipline while carrying it\n\n- The person delivering the urn now gets +25% soul bonus\n\n\n\n- Reworked how Powerups work. There are now only 2 locations where they spawn instead of 6 (the two at the strong camps near the middle far edges of the map). The different powerup types are reduced from 6 to 4 and they have been reworked:\n\n    Gun: +30% Clip and +20% Fire Rate for 100s\n\n    Survival: +400 Max HP and +1% HP Regen for 100s\n\n    Casting: +20% Cooldown Reduction and +25 Spirit for 100s\n\n    Movement: +2 Stamina, +2 Sprint and +30% zipline boost for 100s\n\n- Powerups now always cycle which ones spawn until they have each spawned, and then they are randomly allocated again\n\n\n\n- Base Guardians and Shrines now have +40% Bullet Resistance. They lose 20% for each enemy hero nearby (down to a minimum of 0% bullet resistance). When they haven't taken damage for 60 seconds, they regenerate 4% max hp per second.\n\n- Fixed Walkers not using their stomp properly\n\n\n\n- Troopers now deal 25% less damage to other troopers\n\n- Troopers spawn rate before 10 minutes is now the same as after 10 minutes (30s->25s)\n\n\n\n- Breakables are no longer pre-placed on the map, they now spawn in when they are able to roll for drops (3 minutes)\n\n- Breakables now use pseudorandom rolls (makes streaks of success or failure less likely)\n\n- Golden Statue bonuses now have some dynamic weighting based on what has already dropped (makes it less likely that you have too many of one specific bonus over the course of the game)\n\n- Golden Statue's CD Reduction bonus increased from 0.5% to 0.75%\n\n- After 25 minutes, the Golden Statue bonuses that drop are slightly stronger:\n\n    Max HP: +15 to +20\n\n    Weapon Damage: +2% to +3%\n\n    Spirit Power: +2 to +3\n\n    Fire Rate: +1.5% to +2%\n\n    CD Reduction: 0.75% to 1%\n\n    Ammo: 3% to 5%\n\n\n\n- Bullet falloff damage now starts at 25m instead of 27m\n\n\n\n- Inner lane Walker arena (Amber Orange and Sapphire Blue):\n\n    - Added hallway on street level from the warehouse interior to underneath the overpass\n\n    - Reworked stairs for defenders to reach the overpass to start near the Walker and exit with line of sight down the lane\n\n- Added some juke closets around the map\n\n- Added some balconies/awnings around the map\n\n- Shortened the underground tunnels from the Subway entrance side\n\n- Doorways into the Authority Building and Jazz Club are now offset\n\n- Moved the new cover barrier in front of the inner lane Guardian closer to the Guardian\n\n\n\n\n\n\n\n[ Item Gameplay ]\n\n\n\n- Headshot Booster: Cooldown increased from 5s to 7s\n\n- Headshot Booster: Fixed the item not visually going on cooldown when it procs\n\n- Basic Magazine: Ammo increased from 15% to 20%\n\n- Medic Bullets: Renamed to Restorative Shot\n\n- Restorative Shot: Cooldown increased from 4s to 6s\n\n- Monster Rounds: Damage vs NPCs increased from +30% to +35%\n\n- Active Reload: Cooldown reduced from 25s to 23s\n\n- Active Reload: Active fire rate bonus increased from 15% to 18%\n\n- Berserker: Weapon Damage per stack reduced from +6% to +5%\n\n\n\n- Titanic Magazine: Reload penalty reduced from -15% to -10%\n\n- Intensifying Magazine: Ammo reduced from 30% to 25%\n\n- Point Blank: Now gives +1 Stamina\n\n- Hunter's Aura: Bullet Resist reduction reduced from -15% to -10%\n\n- Hunter's Aura: Fire Rate slow reduced from -15% to -10%\n\n- Hunter's Aura: Solo enemy hero case increased from 2x to 3x\n\n- Burst Fire: Slide distance increased from +35% to +50%\n\n- Tesla Bullets: Damage is now affected by falloff\n\n- Tesla Bullets: Proc chance reduced from 30% to 25%\n\n- Tesla Bullets: Jump radius reduced from 9m to 8m\n\n- Escalating Resilience: Now gives +14% Ammo\n\n\n\n- Lucky Shot: Slow duration reduced from 2s to 1.5s\n\n- Lucky Shot: No longer provides +20% Weapon Damage\n\n- Ricochet: Ricochet damage increased from 45% to 50%\n\n- Silencer: Debuff duration reduced from 3s to 2s\n\n- Crippling Headshot: Bullet and Spirit Resist reductions reduced from -30% to -24%\n\n- Siphon Bullets: Steal duration increased from 15s to 20s\n\n\n\n\n\n- Sprint Boots: Sprint Speed reduced from +3 to +2\n\n- Sprint Boots: Now a component of Enduring Speed\n\n- Extra Stamina: Now provides +10% Stamina Recovery\n\n- Extra Health: Increased from +140 to +150\n\n\n\n- Enduring Speed: Now requires Sprint Boots\n\n- Enduring Speed: Now grants +2 Sprint\n\n- Restorative Locket: Can now be cast on allies (30m cast range)\n\n- Restorative Locket: Radius on gaining charges increased from 40m to 50m\n\n- Restorative Locket: Cooldown increased from 18s to 24s\n\n- Reactive Barrier: Now procs on displacement abilities (e.g. Hook, Paradoxical Swap, Upper Cut)\n\n- Healbane: Debuff duration reduced from 7s to 6s\n\n- Return Fire: Health bonus increased from +75 to +100\n\n- Return Fire: Fixed spirit damage returned counting as bullet damage\n\n- Bullet Lifesteal: Increased from 22% to 24%\n\n\n\n- Rescue Beam: Cooldown reduced from 40s to 35s\n\n- Superior Stamina: Removed spirit bonus when doing 2x air jumps/dash\n\n- Superior Stamina: Now grants +8 Spirit\n\n- Superior Stamina: Now grants +30% Air Dash and Air Jump distance\n\n- Fortitude: Duration required to start regenerating reduced from 14s to 13s\n\n- Majestic Leap: Shields no longer prevent the item from being disabled\n\n- Debuff Reducer: The active now reduces the duration of existing debuffs by 80% of their current values. Grants +2m/s for 3s if a debuff was reduced.\n\n- Debuff Reducer: Passive debuff resistance increased from 30% to 35%\n\n- Debuff Reducer: Now gives +125 Health\n\n- Debuff Reducer: Cooldown reduced from 45s to 25s\n\n\n\n- Unstoppable: No longer has components (loses slow resist and movespeed bonus)\n\n- Colossus: Cooldown reduced from 65s to 45s\n\n- Colossus: Model size increase from 10% to 20%\n\n- Inhibitor: No longer grants +10% Fire Rate\n\n- Inhibitor: Slow reduced from 35% to 25%\n\n- Leech: Spirit Power increased from +7 to +10\n\n- Leech: Weapon Damage increased from +8% to +12%\n\n- Leech: Bonus Health increased from +125 to +150\n\n- Shadow Weave: Ambush Fire Rate reduced from +60% to +40%\n\n- Shadow Weave: Cooldown increased from 35s to 45s\n\n- Shadow Weave: No longer instantly grants sprint\n\n\n\n\n\n- Infuser: Spirit Power reduced from +18 to +16\n\n- Extra Spirit: Now gives +25 Health\n\n\n\n- Quicksilver Reload: Cooldown increased from 5s to 12s\n\n- Withering Whip: Now grants +50 Health\n\n- Suppressor: Duration reduced from 2.5s to 2s\n\n- Decay: Bleed damage increased from 2.6% of current HP to 2.8%\n\n- Decay: Spirit bonus increased from +5 to +7\n\n- Duration Extender: Now grants +1.5 hp regen\n\n- Bullet Resist Shredder: Debuff duration increased from 6s to 8s\n\n- Bullet Resist Shredder: Now gives +5% Bullet Armor\n\n\n\n- Mystic Slow: Duration reduced from 2.5s to 2s\n\n- Improved Burst: No longer applies 50% slow\n\n- Improved Burst: Now grants +100 Spirit Shield Health\n\n- Improved Burst: Now grants +12% Weapon Damage\n\n- Superior Duration: Imbued duration increased from +30% to +32%\n\n- Superior Duration: Non-imbued duration increased from +22% to +24%\n\n- Improved Spirit: Now grants +75 Health\n\n- Knockdown: Cooldown increased from 30s to 45s\n\n- Ethereal Shift: Cooldown reduced from 30s to 25s\n\n\n\n- Mystic Reverb: The target is now slowed by 50% during the 3s delay\n\n- Diviner's Kevlar: Now provides +8% Cooldown Reduction\n\n- Diviner's Kevlar: Fixed the duration missing in the tooltip\n\n- Diviner's Kevlar: Buff duration increased from 10s to 12s\n\n- Diviner's Kevlar: Now grants +700 Spirit Shield and +700 Bullet Shield\n\n- Escalating Exposure now has a base of -12% Spirit Resist reduction\n\n- Boundless Spirit: Health Regen increased from +10 to +15\n\n- Boundless Spirit: Bonus Health increased from +200 to +300\n\n\n\n\n\n\n\n[ Hero Gameplay ]\n\n\n\n- Abrams: Seismic Impact T3 is now Gain +100 Max HP and +15% Fire Rate per enemy hero hit for 25s\n\n- Bebop: Base HP regen reduced from 2 to 1\n\n- Bebop: Hyper Beam cast range increased from 60m to 70m\n\n- Grey Talon: Guided Owl now grants +4 permanent Spirit Power for each hero killed with it\n\n- Grey Talon: Fixed Charged Shot not piercing if it collides with a Mini Turret\n\n- Haze: Smoke Bomb no longer instantly grants sprint\n\n- Haze: Smoke Bomb duration increased from 6s to 8s\n\n- Haze: Smoke Bomb T1 is now -15s CD\n\n- Haze: Smoke Bomb T2 is now +6 Invis Sprint\n\n- Haze: Smoke Bomb T3 is now Gain +30% Bullet Lifesteal for 8s\n\n- Haze: Sleep Dagger T1 changed from +1s Sleep Duration to Drains 1 Stamina\n\n- Infernus: Flame Dash dps linger duration increased from 0.4s to 1s\n\n- Ivy: Fixed some bugs with Watcher's Covenant that caused it to sometimes disconnect/reconnect unintentionally\n\n- Ivy: Watcher's Covenant distance threshold to pick a new target increased from 2.5m to 6m\n\n- Ivy: Watcher's Covenant can now be cast again on an ally while the buff is active to make it prioritize that hero when possible\n\n- Kelvin: Fixed Frost Grenade not going where you had targeted if you moved quickly during the cast\n\n- Kelvin: Ice Path T3 bonus now lingers for 6s extra\n\n- Lash: Death Slam time to lock on increased from 0.8s to 0.9s\n\n- McGinnis: Mini Turret damage reduction against troopers/neutrals increased from -30% to -40%\n\n- McGinnis: Mini Turret damage reduction against objectives increased from -50% to -60%\n\n- McGinnis: Mini Turret falloff damage increased from -30% to -35%\n\n- McGinnis: Mini Turret cooldown reduced from 30s to 28s\n\n- McGinnis: Mini Turret recharge time reduced from 6s to 5s\n\n- McGinnis: Spectral Wall T1 and T2 swapped\n\n- McGinnis: Spectral Wall T1 stamina drain reduced from 2 to 1\n\n- Mo & Krill: Fixed Combo not gaining bonus HP when enemies died during it unless you got the killing blow\n\n- Mo & Krill: Health growth per boon reduced from 47 to 44\n\n- Mo & Krill: While burrowed you have the same cast rules as the unborrow phase (i.e. can cast items and Scorn)\n\n- Seven: Static Charge cast range now scales with Spirit (0.1)\n\n- Vindicta: Flight cooldown reduced from 50s to 45s\n\n- Vindicta: Flight up and down speed improved a bit\n\n- Warden: Binding Word now drains 1 stamina from the target on cast\n\n- Wraith: Project Mind T3 cooldown reduced from -35s to -30s"
}