{
    "poster": "Yoshi",
    "date": "Aug 1, 2024",
    "time": "2:47 PM",
    "content": "[ General Changes ]\n\n\n\n- Added a new hero, Viscous. He's green.\n\n\n\n\n\n- Improved client performance\n\n\n\n- Reworked the Hero Builds system. Browsing and editing builds now happens within the Shop UI (accessible via Sandbox or during a normal game). You can create custom categories for items with unique names and descriptions that can be independently resized and positioned. The interface for browsing builds has also been improved, public builds will now be sorted by popularity (number of favorites). Old builds are incompatible with this system, so they won't be visible in this UI, but we'll have a console command we'll release soon that you can use to print out your older guides if you need them for reference.\n\n\nView attachment dl_builds.mp4\n\n\n\n\n\n- North America (NA) servers have been moved from the west coast to closer to the middle of the country to make latency between east and west coast a little more even, as the majority of users are east coast now. The total average ping amongst all players will be lower as a result of this (a little higher for some and a lot lower for others).\n\n- NA region testing times now start 1 hour earlier weekdays and weekends\n\n\n\n- Minimum hero roster requirement reduced from 4 to 3\n\n\n\n- Added Oceanic servers and matchmaking region. Testing times are displayed in the client\n\n\n\n- Added Teleporter icons on the minimap. The icons glow when you get close to them and pulse on the teleporter's exit location to show you the destination when you are about to enter it.\n\n\nView attachment dl_minimap_teleporter.mp4\n\n\n\n\n\n- When using the underground tunnels, the primary minimap fades out and an underground map for that area shows you your path and the exit locations.\n\n\nView attachment DL_minimap_tunnels.mp4\n\n\n\n\n\n- Reworked the invite system in the client to streamline the process. Emails are no longer required, the users will now receive access directly through Steam and Discord/Forum access will be available through the client. The UI will now also group users into three categories: available to invite, already invited, and already have access. This new system will result in less invitations stuck in limbo, and any previous invites that have not already claimed the game will be granted through this system as well.\n\n\n\n- Hero Sandbox: Added an orb spawner for practicing last-hitting orbs\n\n- Hero Sandbox: Added a dummy hero that patrols left and right to practice targeting\n\n\n\n- Added a checkbox on the startup development dialog to be able to choose to not show it again\n\n\n\n- Your vision through a Cosmic Veil is now based on your hero position rather than camera position\n\n- Adjusted Zipline camera positions for various heroes to help with visibility\n\n- Double tap threshold increased from 0.2s to 0.3s\n\n- Fixed Candle Troopers near-death flash sometimes occurring while moving or doing other active animations\n\n- Candle Trooper behind-wall HUD indicator now also shows near-death state\n\n\n\n- Fixed taking damage not interrupting teleporters\n\n- Fixed clicking on the top bar or minimap to change spectate targets being unreliable\n\n- Fixed Function keys (F1-F5) being broken recently and not spectating team mates\n\n- Fixed various abilities not showing the cast preview correctly on the first use (Mini Turrets, Quantum Entanglement, etc)\n\n- Fixed Paradox Swap sometimes putting players behind walls\n\n- Fixed Lash's Ground Strike sometimes causing the hero to be stuck for the rest of the match\n\n- Fixed Abrams' Charge and Siphon pings not playing the correct VO\n\n- Fixed Walkers having a pause at the end of their Rocket Barrage\n\n- Fixed multiple instances of \"Killing Blow\" in the Damage Report\n\n- Temporarily disabled the audio reminder on being unable to damage the patron while the shrines are alive\n\n- Fixed Spectral Wall forcing itself into the first ability slot if its cooldown is refreshed\n\n- Changed camera to more closely track the followed hero angles when watching replays\n\n- Player names no longer show up above hero's heads when in replay free-cam mode\n\n- Increased post-game time by 1s\n\n- Fixed upgrading abilities via hotkeys not working while dead\n\n- Fixed dead player minimap icons showing over enemy players who are below street level and over shop icons\n\n- Fixed various bugs with Infernus that caused significant lag\n\n- Fixed Shrines not having collision\n\n- Fixed crosshair sometimes being stuck hidden for Yamato after Flying Strike was interrupted\n\n- Added a bunch of new Ivy lines including updated pings, kill lines, etc\n\n- Improved mix clarity for game dialog\n\n- Improved distinction between orb collect and orb deny sounds\n\n- Fixed various cheat/debug commands being accessible\n\n- Updated Pocket animations: New crouch walk and aim, updated slide animation, and new firing from slide animation.\n\n- Updated Mo & Krill Burrow start, duration, and end sounds\n\n- Updated Mo & Krill Combo sound\n\n- Updated Mo & Krill Sand Blast cast sound mix\n\n- Updated Warden Alchemical Flask impact sounds\n\n- Updated Warden Binding Word sound mix for teammates\n\n- Updated Pocket Enchanted Satchel cast and delay sounds\n\n- Added sleep status sound\n\n- Updated Wraith zipline animations\n\n- Fixed a bug with Urn that could cause you to be permanently silenced\n\n- Fixed shop close sounds playing whenever the player enters the radius of a closed shop\n\n- Added new visual effects for Lash's Ground Strike\n\n- Improved ground impact effects for Ivy's True Form\n\n- The client now culls more sounds when they are below a volume threshold\n\n- The server no longer tells clients to play certain sounds when players and spectators are outside of audible range\n\n- Shortened weapons and abilities volume attenuation over distance\n\n- Fixed the console command zoom_sensitivity_ratio affecting both zoomed in and out\n\n- Replaced two oil trucks with a new vehicle prop\n\n- Improved visibility of low health state on troopers about to die\n\n- Fixed Pocket's Cloak being able to tunnel through some ceilings and out of the world\n\n\n\n\n\n\n[ Misc Gameplay ]\n\n\n\n- Reworked the location of the Walker on Amber Yellow and Sapphire Purple lanes. They are a little further towards the map edges. Nearby terrain has been reworked as well.\n\n\n\n\n\n\n\n- The shooting experience near corners has been improved. Previously if your hero's eyes were obstructed at all, you would be unable to shoot altogether even if a large portion of your body was clearly visible. The check will now be a little more sophisticated and custom per hero, to allow you to shoot if your body is reasonably exposed. A part of this will also involve your hero leaning out a bit if not enough of your model is exposed to enemies.\n\n\n\n- Soul Orbs now fly out in different initial directions before floating up. There is a 1/3rd chance it goes left, 1/3rd chance it goes right, and 1/3rd chance it goes up.\n\n\n\n\n\n- Teleporters are now in pairs that send you between them to traverse the map horizontally\n\n- Removed outer lane teleporters\n\n- Added teleporters to areas between lanes (one in each quadrant). Total of 6 teleporters.\n\n\n\n\n\n- Old teleport exit location changed to a connection to the street that slopes down to Mid\n\n\nView attachment mid_update (1).mp4\n\n\n\n- Added connection from the underground teleport station to the outer lane Guardian (previously a juke spot)\n\n\nView attachment station_update (2).mp4\n\n\n\n- Added steam tunnel connection from Amber Blue Guardian and Sapphire Orange Guardian to Mid (one-way)\n\n\nView attachment mid_update_2 (1).mp4\n\n- Each trooper you shoot at will now consider you a higher priority than Guardians/Walkers; that trooper will stop shooting the Guardians/Walkers and consider you its target for a few seconds\n\n- Walker laser DPS vs troopers increased from 150 to 190\n\n- Parrying a Guardian attack will no longer cause the Guardian to be stunned\n\n\n\n- When Shrines are destroyed the Patron gets more aggressive, moves faster, and does more damage\n\n- Weakened Patron HP regen increased from 80 to 120\n\n- Weakened Patron out of combat delay reduced from 30s to 20s\n\n\n\n- Rejuv bonus reduced from 75% to 50% respawn time reduction\n\n- Mid Boss health gained per minute increased from 350 to 425\n\n\n\n- Urn now gives the team that is behind +2 more sprint when carrying it\n\n- Bullet damage falloff now maxes out at ~60m instead of ~65m\n\n\n\n- Movement Powerup: Stamina regen increased from 20% to 30%\n\n- Movement Powerup: Sprint speed increased from +2 to +3\n\n- Movement Powerup: Zipline bonus increased from 30% to 50%\n\n- Gun Powerup: Ammo increased from +30% to +40%\n\n- Powerup durations increased from 150s to 160s\n\n\n\n- Reworked the climb-up exit from the Cosmic Veil space on the outer lanes\n\n\nView attachment climb_update (1).mp4\n\n\n\n- Moved kiosk cover prop in the outer lanes to space out trooper paths\n\n- Moved delivery truck out from the street curb near the underground shop\n\n- Moved breakable idols from the street level juke spots to other locations\n\n- Removed the tree in front of the Walkers on Amber Orange and Sapphire Blue\n\n- Replaced some trees on the Amber side with steam vents\n\n- Moved barrel cover barrier to block the Guardian shop opening on Amber Purple and Sapphire Yellow\n\n- Raised the sign on the roof of the garage\n\n- Removed the smoke wall from the end of the alleys\n\n\n\n\n\n[ Weapon Items ]\n\n\n\n- Hollow Point Ward: Bonus damage reduced from 25% to 20%\n\n- Monster Rounds: HP Bonus increased from +50 to +65\n\n- Rapid Rounds: HP Penalty increased from -40 HP to -50 HP\n\n\n\n- Mystic Shot: Base Spirit Damage reduced from +70 to +65\n\n- Berserker: Damage required to earn a stack increased from 100 to 110\n\n- Kinetic Dash: Now gives 1 HP regen\n\n- Slowing Bullets: Weapon Damage increased from 14% to 16%\n\n\n\n- Added a new T3 Weapon Item, Pristine Emblem: Gives +25% Weapon Damage, +12 Spirit Power, and +12% Spirit Armor. When an enemy is above 50% HP, you deal an additional +25% Weapon Damage.\n\n- Hunter's Aura: No longer grants +16% Ammo\n\n- Hunter's Aura: Now grants +150 Health\n\n- Point Blank: Bullet Shield increased from 250 to 300\n\n- Point Blank: Weapon Damage increased from 40% to 45%\n\n- Titanic Magazine: Now gives +8% Bullet resistance\n\n- Heroic Aura: Bonus Health increased from +125 to +150\n\n- Intensifying Magazine: Fixed a bug that allowed you to gain weapon damage without firing\n\n\n\n- Ricochet: Bonus Health increased from 100 to 125\n\n- Ricochet: Now gives +8% Fire Rate\n\n- Glass Cannon: Weapon Damage increased from 70% to 75%\n\n- Silencer: Cooldown increased from 25s to 34s\n\n- Siphon Bullets: Weapon damage is no longer conditional on 15m, now always gives +40% Weapon Damage (previously gave +45% when close)\n\n- Spiritual Overflow: Now grants +10% Spirit Lifesteal\n\n\n\n\n\n\n\n\n\n[ Vitality Items ]\n\n\n\n- Extra Regen: Regen increased from 2.5 to 2.7\n\n- Melee Lifesteal: Bonus health increased from +50 to +70\n\n\n\n- Restorative Locket: When consuming at max stacks, replenishes target's stamina fully\n\n- Return Fire: Bullet Damage returned increased from 70% to 80%\n\n- Return Fire: Bonus HP increased from +100 to +125\n\n- Divine Barrier: Cast range increased from 30m to 35m\n\n- Divine Barrier: Now grants +1.5 HP Regen\n\n- Health Nova: Bonus HP increased from +50 to +75\n\n- Reactive Barrier: Now grants +75 HP\n\n\n\n- Rescue Beam: Pull speed is now 25% faster\n\n- Rescue Beam: Now grants +2 Sprint\n\n- Rescue Beam: Bonus HP increased from +100 to +125\n\n- Metal Skin: Duration increased from 3s to 3.5s\n\n- Lifestrike: Bullet Resist increased from 6% to 8%\n\n- Veil Walker: Bullet and Spirit Shields increased from 185 to 200\n\n- Veil Walker: Cooldown reduced from 20s to 18s\n\n- Veil Walker: Weapon Damage increased from 6% to 10%\n\n- Superior Stamina: Fire Rate reduced from 15% to 10%\n\n\n\n- Colossus: Bonus HP increased from 500 to 600\n\n- Soul Rebirth: Cooldown reduction increased from 10% to 15%\n\n- Phantom Strike: Cast range increased from 30m to 35m\n\n- Inhibitor: Debuff duration increased from 2s to 2.5s\n\n- Leech: Now provides +30% Degen Resistance (reduces anti heal effects by 30%)\n\n\n\n\n\n\n\n\n\n[ Spirit Items ]\n\n\n\n- Spirit Strike: Spirit Damage increased from 30 to 40\n\n- Ammo Scavenger: Spirit Power duration increased from 18s to 24s\n\n\n\n- Cold Front: Damage reduced from 115 to 100\n\n- Cold Front: Spirit Power damage scaling increased from 0.98 to 1.25\n\n- Duration Extender: Bonus HP increased from 75 to 100\n\n\n\n- Silence Glyph: Spirit Shield increased from 150 to 225\n\n- Superior Duration: Bonus HP increased from 125 to 175\n\n- Surge of Power: Imbued Spirit Power increased from +24 to +26\n\n- Torment: Now has a regular cooldown that is reduced by cooldown reduction\n\n\n\n- Escalating Exposure: First stack no longer does double amp value\n\n- Escalating Exposure: Now passively applies -12% Spirit Resist when dealing Spirit Damage\n\n- Refresher: Cooldown reduced from 220s to 200s\n\n- Refresher: Spirit Resist increased from 12% to 14%\n\n- Echo Shard: Bullet Resist increased from 10% to 16%\n\n- Diviner's Kevlar: Buff duration increased from 12s to 15s\n\n\n\n\n\n\n\n\n\n[ Hero Gameplay ]\n\n\n\n- Abrams: Fixed Shoulder Charge not stunning the target when colliding with Kelvin's Ice Dome\n\n- Abrams: Fixed some cases where Shoulder Charge did not stun when hitting a wall\n\n- Abrams: Fixed enemies being able to double jump out of Seismic Impact\n\n- Abrams: Shoulder Charge T3 reduced from +6.5 to +5.5 Weapon Damage\n\n- Abrams: Seismic Impact damage reduced from 200 to 175\n\n\n\n- Bebop: Bullet Resistance growth per boon increased from 2% to 2.5%\n\n- Bebop: Sticky Bomb now prioritizes enemies over allies\n\n- Bebop: Hyper Beam duration now scales with Spirit (0.08)\n\n- Bebop: Hyper Beam spirit scaling increased from 2.2 to 2.4\n\n\n\n- Dynamo: Kinetic Pulse width increased from 4m to 4.5m\n\n- Dynamo: Kinetic Pulse recharge time reduced from 6s to 5s\n\n- Dynamo: Rejuvenating Aurora regen Spirit Power scaling increased from 0.4 to 0.5\n\n\n\n- Grey Talon: Charged Shot collision size reduced by 10%\n\n- Grey Talon: Guided Owl explosion radius increased from 10m to 12m\n\n- Grey Talon: Guided Owl cooldown reduced from 120s to 110s\n\n\n\n- Haze: Bullet damage falloff is now 20% more falloff than default\n\n- Haze: Can now cast Smoke Bomb while on zipline\n\n\n\n- Infernus: Fixed Infernus being unable to slide out of Flame Dash\n\n- Infernus: Afterburn T1 and T2 Swapped\n\n- Infernus: Afterburn base DPS reduced from 18 to 15\n\n- Infernus: Afterburn T3 DPS reduced from 33 to 30\n\n- Infernus: Afterburn spirit scaling increased from 0.4 to 0.5\n\n\n\n- Kelvin: Fixed Arctic Beam not having proper lag compensation\n\n- Kelvin: Fixed some cases where Frost Grenade would explode and not hit anyone\n\n- Kelvin: Arctic Beam can now be canceled directly by using parry\n\n- Kelvin: Frost Grenade cast time reduced from 0.2s to 0.1s\n\n- Kelvin: Frost Grenade recharge time reduced from 8s to 7s\n\n- Kelvin: Ice Path sprint is now granted immediately on use\n\n\n\n- Lady Geist: Base sprint reduced from 2 to 1\n\n\n\n- Lash: Base sprint reduced from 3 to 1\n\n- Lash: Ground Strike Damage Per Meter reduced from 6.3 to 6.0\n\n\n\n- McGinnis: Mini Turrets no longer target immune structures\n\n- McGinnis: Heavy Barrage cast/aim behavior improved for indoors and close range\n\n- McGinnis: Reverted recent melee damage reduction\n\n- McGinnis: Fixed Health Nova not working on Mini Turrets (when Health Nova was cast by McGinnis)\n\n- McGinnis: Mini Turret base HP increased from +50 to +75\n\n\n\n- Mo & Krill: Can now reload while burrowed\n\n\n\n- Paradox: Kinetic Carbine Time Slowed targets that were moving before the time slow will now resume their momentum when time slow wears off\n\n- Paradox: Bullet (and Kinetic Carbine) projectile speed reduced by 10%\n\n- Paradox: Ammo count reduced from 54 to 45\n\n\n\n- Pocket: Affliction damage is dealt over 18s instead of 16s (same total damage, lower DPS)\n\n- Pocket: Enchanter's Satchel T3 changed from Disarms for 2.5s to Applies -40% Fire Rate for 4s\n\n\n\n- Seven: Static Charge stun duration reduced from 1.25s to 1.1s\n\n- Seven: Static Charge T3 stun duration reduced from 1.25s to 1.1s\n\n- Seven: Static Charge T2 radius increased from +5m to +7m\n\n- Seven: Headshot damage taken reduced by 25%\n\n\n\n- Vindicta: Flight cooldown reduced from 45 to 40\n\n- Vindicta: Gun damage growth increased from 0.85 to 1.0\n\n\n\n- Wraith: Card Trick post cast time reduced from 0.5s to 0.2s\n\n- Wraith: Fixed some issues Card Trick tracking that could cause it to orb players or go to the wrong spot\n\n\n\n- Yamato: Power Slash collision size reduced by 10%\n\n- Yamato: Bullet damage growth increased from 0.4 to 0.5"
}