{
    "poster": "Yoshi",
    "date": "Aug 15, 2024",
    "time": "2:18 PM",
    "content": "[ General Changes ]\n\n\n\n- Added a new hero, Shiv\n\n\n\n- Games can now be watched by an unlimited number of spectators\n\n- Spectator games now have 1 minute delay\n\n\n\n- Added localization for Simplified Chinese, Russian, Brazilian Portuguese, Spanish (Spain), Spanish (Latin America), Turkish, Ukrainian, Czech, and French. These are currently a work-in-progress.\n\n- Language can be selected from the settings menu\n\n\n\n- Matchmaking windows are now open 1 hour earlier in all regions\n\n\n\n- You can now prioritize your roster into three groups to indicate your preference ordering to the matchmaker: Selected, Priority, High Priority\n\n\n\n- Added customization options for your crosshair\n\n\n\n- Builds: You can now author a suggested ordering of Ability Upgrades\n\n- Builds: You can now add per-item author comments by right clicking on items while editing builds that will show up in the item tooltip for users of the build\n\n- Fixed a bug that allowed published build data to overwrite local changes to a published build\n\n- Fixed a bug that prevented the last used hero build from loading when it was not a favorited build\n\n- Hovering items in the shop will now highlight their components, or which item they are components of\n\n\n\n- Reworked the Hero Stats UI in the shop\n\n- Hero Stats in the shop have been expanded and are now broken up by Weapon, Vitality, and Spirit. Various additional stats that were previously hidden have been added here.\n\n- Individual stats can now be hovered over to see a breakdown of all the bonuses contributing to a value, including things like golden statues\n\n- Added descriptive gun information to each hero\n\n- Added Spirit Power Impact panel that displays the effect of Spirit Power on your Abilities and Items\n\n\n\n- Added Outgoing Damage as a UI display mode that you can toggle through\n\n- Added a setting to let you customize the ability cancel hotkey (default is spacebar)\n\n- Added a \"Friends Only\" checkbox to filter the watch tab\n\n- Added an option to control zoom sensitivity\n\n\n\n- Fixed Candle Troopers sometimes instantly disappearing on death rather than going into their death flash state\n\n- Using an active item or ability removes the undo option for the item/AP\n\n- Fixed some abuse cases with undoing AP cooldown reductions\n\n- Added a video setting to reduce flashing effects\n\n- Unpause hotkey is now displayed when the game is paused\n\n- Pause cooldown per player increased from 10 minutes to 15 minutes\n\n\n\n- Improved visual clarity of Grey Talon's trap armed state\n\n- Replaced the Urn drop parachute with new effects\n\n- Fixed some cases where the comeback souls would be higher than intended in the early game\n\n- Fixed being unable to ping while dead\n\n- Fixed Bebop's Sticky Bomb sometimes misfiring\n\n- Improved smoothing of spectator camera position and angles\n\n- Fixed a bug that allowed teleporters to be used while carrying the Soul Urn\n\n- Fixed targeting previews that draw a model (like McGinnis's turrets) to update every frame, instead of being fixed at 60hz\n\n- Fixed stuns resetting their duration if you were on the ground and became airborne\n\n- Fixed some cases where Lash's Ground Strike would cause your hero to be stuck\n\n- Fixed Ricochet sometimes shooting the extra bullet from your gun rather than the target\n\n- Fixed Arctic Beam T3 range not being calculated correctly when you have range increase items\n\n- Fixed ESC not working to close Settings popup sometimes\n\n- Various visual adjustments on highlight and strobe effects being too loud in some cases\n\n- Holding M1 down while Flame Dash ends will now cause you to fire your gun instead of requiring you to let go and press again\n\n- Added popup to bot games to indicate that they tend to be much longer games than normal ones\n\n- Improved Abrams Siphon and Seismic Impact visuals to not obstruct player view as much\n\n- Added new Silence status effect sound\n\n- Updated bullet whizby sounds for nearly all characters\n\n- Updated Haze Sleep Dagger cast, projectile loop and whizby\n\n- Updated Haze Smoke Bomb sound\n\n- Removed Haze Smoke Bomb voice line for everyone except the casting player and spectators\n\n- Fixed some spectator/replay sound and music bugs\n\n- Various sound related performance improvements\n\n- More impactful damage indication sound for attackers\n\n- Remastered Abrams, Pocket, and Dynamo weapon fire sounds\n\n- Improved lighting performance around shop\n\n- Improved Wraith tracers to feel more connected to their bullet\n\n- Improved visibility of AOE around Bebop while casting Hyper Beam\n\n- Improved effects around Lady Geist Soul Exchange to help with clarity\n\n- Updated Infernus tracer, muzzle, and impact fx revisions for better performance\n\n- Fixed Mimic options in sandbox not working properly\n\n- Added a sound for movement being restricted by Slowing Hex and Vindicta tether\n\n- Revised sounds for Pocket Flying Cloak duration and warp\n\n- Clarified Vindicta Flight T1 tooltip\n\n- Added alternate shop music\n\n- Added Refresher cast sound\n\n\n\n\n\n\n\n\n\n[ Misc Gameplay ]\n\n\n\n- Teleporter activation no longer gets canceled on incoming damage.\n\n- Teleporter channel time increased from 4s to 5s\n\n\n\n- Walkers now require you to be within 30m to deal damage to them\n\n- Walker Health increased by 15%\n\n- Base Guardian Health increased by 20%\n\n- Patron damage increased by 30% after it is vulnerable\n\n- Weakened Patron Health increased by 15%\n\n- Weakened Patron now has a Torment Pulse style effect, hitting up to 2 enemies in the pit for 75 damage per second\n\n- You can now use melee hotkey while zoomed to exit zoom and perform a melee\n\n\n\n- Added Bounce Pads in various areas of the map that launch you in a defined direction\n\n\n\n\nView attachment bounce_update.mp4\n\n\n\n- Added one-way defender exits beside each outer lane entrance\n\n- Added Speed Boost Volumes in the defender passages on the outsides of the base\n\n\n\n\nView attachment speed_boost_update.mp4\n\n\n\n- Firehouse (building next to Sapphire Yellow Guardian) has been reworked to match the layout of the Chapel\n\n\n\n- Low roof buildings beside Amber Purple Guardian and Sapphire Yellow Guardian are now valid play spaces\n\n  - Removed zap triggers\n\n  - Added truck on the back side of those buildings to allow climbing up\n\n  - Removed rooftop props for those buildings\n\n  - Added billboards to the edge closest to the lane\n\n\n\n- Low roof buildings between inner lane Walker arenas are now valid play spaces\n\n  - Removed zap triggers\n\n  - Expanded rooftop size\n\n  - Added fire escape stairs to allow access from the upper level from the Mid\n\n\n\n\nView attachment rooftop_update.mp4\n\n\n\n\n\n- Walker Arena - Amber Yellow/Sapphire Purple:\n\n  - Added catwalks from high ground defender area to building across the street\n\n  - Added passage through building and stairs up to a peek spot toward the Guardian\n\n  - Replaced upper floor juke spot with a connection through building across from new peek spot\n\n\n\n\nView attachment yellow_update.mp4\n\n\n\n\n\n- Walker Arena - Amber Orange/Sapphire Blue:\n\n  - Added catwalk from the low roof building to the building across the street\n\n  - Replaced juke spot in the courtyard with passage connecting to the new catwalk\n\n  - Widened hallway above Underground Shop\n\n  - Removed railing and added stairs in the passage toward the Guardian\n\n  - Courtyard floor opening to the Underground Shop moved closer to above the shop\n\n  - Bounce Pad added to allow easier navigation from the Underground Shop to the upper courtyard. Replaces a juke spot.\n\n\n\n\nView attachment orange_update.mp4\n\n\n\n- Walker Arena - Amber Blue/Sapphire Orange:\n\n  - Added interior shaft with Bounce Pad to an upper level balcony from defender side to face the Guardian\n\n  - Added a Bounce Pad on the ground floor of the Police Station/Garment Building to the upper floor\n\n  - Added a juke spot inside the Police Station/Garment Building\n\n  - Added a juke spot down the stairs from the Guardian to the left\n\n\n\n\nView attachment blue_update.mp4\n\n\n\n\n\n- Walker Arena - Amber Purple/Sapphire Yellow:\n\n  - Added an interior corridor through the building between the base and the Walker\n\n  - Added a balcony that borders the arena on the back side of the Walker\n\n\n\n\nView attachment purple_update.mp4\n\n\n\n\n\n[ Weapon Items ]\n\n\n\n- Headshot Booster: No longer has +40 Bonus Health\n\n- Headshot Booster: Now has +40 Bullet Shield\n\n- Monster Rounds: Health reduced from +65 to +50\n\n- Monster Rounds: Now grants +30% Bullet Resistance vs NPCs\n\n- Restorative Shot: Weapon Damage increased from 6% to 8%\n\n\n\n- Active Reload: Lifesteal reduced from 40% to 30%\n\n- Active Reload: Fire Rate reduced from 24% to 20%\n\n- Kinetic Dash: HP regen increased from 1 to 1.5\n\n- Long Range: Min distance reduced from 18m to 15m\n\n- Mystic Shot: Cooldown increased from 5s to 6s\n\n- Slowing Bullets: Now grants +5 Spirit\n\n- Soul Shredder Bullets: Now grants +6% Weapon Damage\n\n- Soul Shredder Bullets:  Debuff duration increased from 5s to 6s\n\n- Berserker: Fixed gaining stacks much faster than intended when taking damage from troopers\n\n\n\n- Warp Stone: Active Bullet Resist reduced from +60% to +40%\n\n- Warp Stone: No longer grants +2 Sprint\n\n- Warp Stone: Now gains +8 Spirit\n\n- Point Blank: No longer grants +300 Bullet Shield\n\n- Point Blank: Now grants +15% Bullet Armor\n\n- Escalating Resilience: Max Bullet Resist increased from 30% to 36%\n\n- Heroic Aura: Lifesteal increased from 18% to 20%\n\n- Alchemical Fire: Bullet Shield increased from 175 to 225\n\n- Sharpshooter: Min distance reduced from 18m to 15m\n\n- Titanic Magazine: Weapon Damage increased from 16% to 18%\n\n- Titanic Magazine: Bullet Resist increased from 8% to 10%\n\n- Intensifying Magazine: Time for Max Damage reduced from 3.5s to 3s (this is a buff)\n\n\n\n- Ricochet: Fire Rate increased from +8% to +12%\n\n- Ricochet: Health increased from +125 to +150\n\n- Siphon Bullets: You permanently steal 1 stack (45 HP) from the enemy if they die under the debuff. If an enemy you stole a stack from kills you, they regain 1 stack back.\n\n- Silencer: Reduced active duration from 6s to 4s\n\n- Glass Cannon: Now gives +1 Movement Speed\n\n- Glass Cannon: No longer gives +2 ammo on kill\n\n- Glass Cannon: Weapon Damage reduced from +75% to +70%\n\n- Glass Cannon: Now gives +10% Weapon Damage per kill (up to +50%)\n\n- Glass Cannon: When you die you lose a stack\n\n\n\n\n\n\n\n\n\n[ Vitality Items ]\n\n\n\n- Melee Lifesteal: Heal effectiveness vs non-heroes increased from 25% to 35%\n\n- Melee Lifesteal: Health increased from +70 to +75\n\n- Extra Regen: Regen increased from 2.7 to 2.8\n\n- Healing Rite: Cooldown reduced from 75s to 65s\n\n- Healing Rite: Cast Range increased from 20m to 30m\n\n\n\n- Healing Booster: Spirit Resist reduced from +7% to +6%\n\n- Healing Booster: Bullet Resist reduced from +7% to +6%\n\n- Divine Barrier: Duration increased from 4s to 5s\n\n- Divine Barrier: Cooldown reduced from 30s to 28s\n\n- Restorative Locket: Max Stacks reduced from 20 to 15\n\n- Restorative Locket: Heal per stack increased from 30 to 40\n\n- Health Nova: Health increased from +75 to +100\n\n- Combat Barrier: Weapon Damage While Shielded increased from +24% to +28%\n\n- Enchanter's Barrier: Spirit Power while Shielded increased from +17 to +20\n\n- Bullet Lifesteal: Lifesteal increased from +26% to 28%\n\n\n\n- Superior Stamina: Air Jump/Dash Distance reduced from +50% to +40%\n\n- Superior Stamina: Fire Rate reduced from 10% to 7%\n\n- Debuff Remover: Debuff resistance reduced from +40% to +35%\n\n- Lifestrike: Heal effectiveness vs non-heroes increased from 25% to 35%\n\n- Lifestrike: Heal increased from 45% of melee damage to +55%\n\n- Majestic Leap: Health increased from +100 to +125\n\n- Majestic Leap: Spirit Power increased from +8 to +10\n\n- Metal Skin: Cooldown reduced from 30s to 25s\n\n- Fortitude: Out of combat regen timer reduced from 13s to 12s\n\n- Rescue Beam: Cooldown reduced from 30s to 25s\n\n\n\n- Soul Rebirth: Rebirth Health increased from 40% to 50%\n\n- Soul Rebirth: Cooldown reduced from 240s to 200s\n\n- Inhibitor: Weapon Damage increased from 20% to 25%\n\n- Colossus: Slow increased from 20% to 25%\n\n- Colossus: Slow now affects stamina distances\n\n- Phantom Strike: Cast range reduced from 35m to 30m\n\n\n\n\n\n\n\n\n\n[ Spirit Items ]\n\n\n\n- Infuser: No longer gives +7% Spirit Resist\n\n- Infuser: Now gives +50 Health\n\n- Spirit Strike: Spirit damage increased from 40 to 50\n\n- Spirit Strike: Debuff increased from -10% Spirit Resist to -12%\n\n- Mystic Reach: Now gives +5% Spirit Resist\n\n- Ammo Scavenger: Spirit Power Duration increased from 24s to 35s\n\n\n\n- Cold Front: Damage reduced from 100 to 75\n\n- Cold Front: Damage Spirit Power scaling increased from 1.25 to 1.5\n\n- Decay: Healing Reduction reduced from -70% to -50%\n\n- Decay: Bleed increased from 2.8% to 3.1%\n\n- Decay: Cooldown increased from 25s to 30s\n\n- Slowing Hex: Debuff no longer cancels active mobility spells, it only prevents them from being casted\n\n- Slowing Hex: Damage reduced from 100 to 70\n\n- Slowing Hex: Cast range reduced from 35m to 25m\n\n- Slowing Hex: Now also reduces stamina distance by 30%\n\n- Slowing Hex: Projectile speed increased from 1200 to 1350\n\n- Withering Whip: Now applies -40% Fire Rate instead of a Disarm\n\n- Withering Whip: Duration increased from 3s to 4.5s\n\n- Withering Whip: Cast range increased from 18m to 24m\n\n- Quicksilver Reload: Infused ability bonus damage increased from +30 to +50\n\n\n\n- Improved Cooldown: Cooldown reduction increased from 14% to 15%\n\n- Ethereal Shift: No longer provides +10% Fire Rate\n\n- Ethereal Shift: Cooldown increased from 25s to 30s\n\n- Improved Burst: Reduced Weapon Damage from +12% to +8%\n\n- Surge of Power: Movespeed duration increased from 5s to 6s\n\n- Surge of Power: Imbued Spirit increased from +26 to +28\n\n- Surge of Power: Now grants +75 Health\n\n- Improved Reach: Now gives +10% Spirit Resist\n\n- Superior Duration: Now provides +15% Weapon Damage\n\n- Mystic Slow: Fire Rate reduction increased from -30% to -40%\n\n- Silence Glyph: No longer reduces Spirit Resist\n\n- Silence Glyph: Now deals +150 damage on impact\n\n- Superior Cooldown: Non-Imbued ability cd reduction increased from 22% to 24%\n\n\n\n- Escalating Exposure: Max Interval improved from 1s to 0.7s\n\n- Diviner's Kevlar: Cooldown increased from 30s to 60s\n\n- Refresher: Spirit Resist increased from 14% to 16%\n\n- Curse: Cooldown increased from 40s to 50s\n\n\n\n\n\n\n\n\n\n[ New Items ]\n\n\n\n- Added a new T1 Weapon item. Grants +35% Bullet Projectile Speed, +14% Weapon Damage and +50 Bullet Shield.\n\n\n\nInspired by:  \nhttps://forums.playdeadlock.com/threads/projectile-speed-increase-item.1539/\n\n\n\n\n\n- Added a new T4 Spirit item, Magic Carpet: Active - After a 1.3s delay, a magic carpet arrives to pick you up. You gain full flight controls and have +6 m/s movement speed. Lasts 7 seconds. If you cast abilities or use your gun, the carpet disappears. While on the Magic Carpet you gain +400 Bullet and +400 Spirit Shields. Passively grants +150 Health, +10% Ability Duration, and +15 Spirit Power. Cooldown: 40s\n\n\n\nInspired by:  \nhttps://forums.playdeadlock.com/threads/a-bunch-of-loose-item-ideas.11618/\n\n\n\n\n\n\n\n\n\n[ Hero Gameplay ]\n\n\n\n- Abrams: Fixed Seismic Impact often not dragging enemies in the air along with you when you are slamming down\n\n- Abrams: Fixed Shoulder Charge not always placing enemies in front of you\n\n- Abrams: Seismic Impact damage reduced from 175 to 150\n\n\n\n- Bebop: Gun range reduced from 50m to 30m + 2.5m/boon (max of 58m)\n\n- Bebop: Speed while shooting increased from 55% to 70%\n\n- Bebop: Base regen increased from 2.5 to 3\n\n- Bebop: Base Bullet Resist increased from 0% to 10%\n\n- Bebop: Bullet Resist per boon reduced from 2.5% to 1.6% (same overall bullet resist at max)\n\n- Bebop: Hook range reduced from 40m to 35m\n\n- Bebop: Hook T2 increased from +25m to +30m\n\n- Bebop: Exploding Uppercut now has a slight angle limitation to prevent straight-up direction\n\n- Bebop: Exploding Uppercut radius increased from 10m to 14m\n\n- Bebop: Exploding Uppercut T1 increased from -10s Cooldown to -11s\n\n- Bebop: Fixed hooking through veils sometimes not working\n\n- Bebop: Sticky Bomb radius increased from 10m to 12m\n\n- Bebop: Sticky Bomb can now be cast on self using alt cast hotkey\n\n- Bebop: Hyper Beam T2 reduced from +140 to +100\n\n- Bebop: Hyper Beam spirit scaling increased from 2.4 to 3.0\n\n- Bebop: Hyper Beam turn rate improved by 10%\n\n- Bebop: Hyper Beam nearby radius increased from 4.5m to 5m\n\n- Bebop: Hyper Beam nearby damage now does 25% less than the full amount\n\n\n\n- Dynamo: Rejuvenating Aurora can now be canceled by using stamina instead of needing to manually exit first (pre T3)\n\n- Dynamo: Fixed Kinetic Pulse sometimes getting caught on stairs\n\n- Dynamo: Singularity now has a 0.1s cast point\n\n- Dynamo: Kinetic Pulse width increased from 4.5m to 5m\n\n- Dynamo: Kinetic Pulse T3 increased from +115 Damage to +125\n\n\n\n- Grey Talon: Charged Shot collision radius reduced by 10%\n\n- Grey Talon: Fixed T3 Guided Owl not triggering correctly sometimes when the target has Spirit Armor\n\n\n\n- Haze: Sleep Dagger now puts you in a brief drowsy state for 0.25s seconds where you move slowly before falling asleep (you still have the ability to shoot/cast/move/etc during this period)\n\n- Haze: Fixation T2 from +6s Duration to +5s\n\n- Haze: Fixation T3 reduced from +0.25 to +0.2\n\n- Haze: Bullet Dance T1 increased from +6 to +7\n\n\n\n- Ivy: Fixed melee still going through when casting Stone Form after initiating a melee attack\n\n- Ivy: Stone Form T2 stun reduced from 0.75s to 0.5s\n\n- Ivy: Watcher's Covenant T1 reduced from +15% Fire Rate to +10%\n\n- Ivy: Now has a new ultimate ability, Air Drop. Take flight with an Ally (or self-cast to carry a bomb). You fly and drop the ally or bomb onto an area, dealing damage, slowing, and silencing enemies. Ivy and the ally gain a bullet shield when they are dropped. Allies can drop by themselves at any time. When using the ability without an ally (carrying a bomb), it has a 1 second cast time.\n\n\n\n- Kelvin: Arctic Beam no longer applies a Disarm\n\n- Kelvin: Arctic Beam now slows Fire Rate (same values as slow)\n\n- Kelvin: Arctic Beam max slow reduced from 90% to 60%\n\n- Kelvin: Arctic Beam time to reach max slow increased from 1.2s to 2s\n\n- Kelvin: Frozen Shelter can now be cast while using Arctic Beam\n\n\n\n- Lash: Health per boon increased from 37 to 42\n\n- Lash: Base spirit resist increased from 8% to 15%\n\n- Lash: Flog cooldown reduced from 30s to 25s\n\n- Lash: Flog T3 now also reduces Fire Rate by 35%\n\n\n\n- McGinnis: Speed while shooting increased from 55% to 70%\n\n- McGinnis: Mini Turrets now prioritize any heroes McGinnis is shooting at\n\n- McGinnis: Medicinal Specter duration Spirit Power scaling increased from 0.09 to 0.12\n\n- McGinnis: Heavy Barrage T1 changed to Rockets apply 35% slow\n\n\n\n- Mo & Krill: Scorn T3 now affects all damage types\n\n\n\n- Paradox: Base ammo reduced from 45 to 40\n\n- Paradox: Kinetic Carbine projectile size reduced by 10%\n\n- Paradox: Kinetic Carbine cooldown increased from 24s to 28s\n\n- Paradox: Kinetic Carbine speed duration reduced from 4s to 3.5s\n\n- Paradox: Kinetic Carbine no longer affects channels, cast times or things like Lash's Death Slam\n\n- Paradox: Kinetic Carbine T1 reduced from +0.75s Max Stop duration to +0.5s\n\n- Paradox: Kinetic Carbine T2 cd reduction increased from -8s to -10s\n\n- Paradox: Time Wall T3 silence duration reduced from 3.5s to 3s\n\n- Paradox: Paradoxical Swap projectile size reduced by 10%\n\n\n\n- Pocket: Barrage now respects line of sight\n\n- Pocket: Barrage amp effect now shows on Pocket\n\n- Pocket: Base Bullet Resist increased from -15% to 0%\n\n- Pocket: Base Spirit Resist reduced from 0% to -15%\n\n- Pocket: Barrage Amp per stack reduced from 10% to 8%\n\n- Pocket: Barrage T3 changed to +5% Amp Per Stack\n\n- Pocket: Fixed the camera moving too slowly after teleporting with Cloak\n\n\n\n- Seven: Fixed multiple instances of Static Charge not working correctly\n\n- Seven: Lightning Ball duration increased from 4s to 5s\n\n- Seven: Static Charge stun delay reduced from 4s to 3.5s\n\n\n\n- Vindicta: Stake base duration reduced from 2.5s to 2.25s\n\n- Vindicta: Stake T1 duration reduced from 1s to 0.75s\n\n\n\n- Viscous: Fixed Splatter direct hits counting as the second hit\n\n- Viscous: Fix Damage prevention after being hit by Viscous' Goo Ball being reduced by Debuff Reducer\n\n- Viscous: The Cube cast range increased from 25m to 30m\n\n- Viscous: The Cube T2 cooldown reduced from -25s to -22s\n\n- Viscous: Puddle Punch now deals light melee damage and is affected by melee items\n\n- Viscous: Puddle Punch Charge Delay increased from 0.5s to 1.5s\n\n- Viscous: Goo Ball duration reduced from 12s to 10s\n\n- Viscous: Goo Ball T1 duration reduced from +6s to +5s\n\n- Viscous: Goo Ball cooldown increased from 80s to 90s\n\n- Viscous: Goo Ball now deals 50% damage to bosses\n\n- Viscous: Goo Ball spirit resist reduced from 80% to 70%\n\n- Viscous: Goo Ball bullet resist reduced from 70% to 60%\n\n- Viscous: Goo Ball can now only stun and damage a target once every 1.5s, up from once every 1.0s\n\n- Viscous: Goo Ball acceleration lowered a bit\n\n- Viscous: Stunning or immobilizing Viscous now stops the ball from moving, and prevents him from doing damage and stunning\n\n\n\n- Warden: Binding Word no longer drains 1 stamina\n\n- Warden: Alchemical Flask cooldown reduced from 16s to 13s\n\n- Warden: Alchemical Flask T2 changed from -10s Cooldown to Drains 1 Stamina\n\n- Warden: Alchemical Flask T3 now also reduces cooldown by -7s\n\n- Warden: Binding Word immobilize duration reduced from 2s to 1.75\n\n- Warden: Binding Word now has a quick cast behavior (same as Static Charge)\n\n\n\n- Wraith: Card Trick now has 0.5s cd per cast\n\n- Wraith: Telekinesis T2 duration reduced from +0.75s to +0.5s\n\n- Wraith: Full Auto T2 changed to Imbues Bullets with +5 Spirit Damage (only affects Wraith)\n\n- Wraith: Fixed being able to melee and parry while stunned by Wraith's Telekinesis\n\n\n\n- Yamato: Base melee damage increased by 10%\n\n- Yamato: Flying Strike T3 now procs after the ability ends, rather than when connecting to the target"
}